<template>
    <div class="pdf-wrap" id="pdf03">
        <!-- 公式参考： https://blog.csdn.net/qq_42454244/article/details/104612666?utm_medium=distribute.pc_relevant.none-task-blog-baidulandingword-3&spm=1001.2101.3001.4242 -->
        <div class="pdf-cover">
            <h1 class="text-c pdf-t"><span>方法精讲 - 资料</span></h1>
        </div>
        
        <div class="chapter-wrap">
            <h2 class="text-c chapter-t"><span>第二章 | 资料分析</span></h2>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s1')">第一节  速算技巧</h3>
                <div class="section-c" v-show="sectionOpen.s1">
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、截位直除</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <dl class="outline">
                                    <dt>【知识点】截位直除：</dt>
                                    <dd>1.什么是截位？</dd>
                                    <dd>（1）保留有效数字（从左边不是 0 的数字开始），看下一位进行四舍五入。</dd>
                                    <dd>&nbsp;&nbsp;- ①142857 截两位：截两位就是保留两位有效数字，保留 14，根据四舍五入，2 太小了就舍去，截两位为 14。</dd>
                                    <dd>&nbsp;&nbsp;- ②142857 截三位：截三位就是保留三位有效数字，保留 142，根据四舍五入，8 可以进位，截三位为 143。</dd>
                                    <dd>&nbsp;&nbsp;- ③在考场上要么截两位，要么截三位，没有必要截四位，选项差距大就截两位，选项差距小就截三位，截一位误差太大。</dd>
                                    <dd>（2）练：</dd>
                                    <dd>&nbsp;&nbsp;- ①34517，截两位：35、截三位：345。</dd>
                                    <dd>&nbsp;&nbsp;- ②1.3368，截两位：1.3、截三位：1.34。</dd>
                                    <dd></dd>
                                    <dd>2.如何截位？看选项。截位直除是估算，选项差距大，说明对结果要求不高，估算的时候可以“浪”一点，所以选项差距大的时候可以截两位计算。</dd>
                                    <dd>（1）首位不同（选项差距大，截两位）。</dd>
                                    <dd>（2）首位相同，看次位差（最接近两项的次位差）：</dd>
                                    <dd>&nbsp;&nbsp;- ①次位差＞首位（选项差距大，截两位）。</dd>
                                    <dd>&nbsp;&nbsp;- ②次位差≤首位（选项差距小，截三位）。</dd>
                                    <dd></dd>
                                    <dd>3.练一练：判断以下选项差距。</dd>
                                    <dd>……</dd>
                                    <dd>4.截谁？看算式。</dd>
                                    <dd>（1）一步除法：只截分母，比如形式为 A/B、A/（B+C）、A/（B-C）。</dd>
                                    <dd>&nbsp;&nbsp;- ①32345/26189</dd>
                                    <dd>&nbsp;&nbsp;- ②4286/（1+21%）。</dd>
                                    <dd>&nbsp;&nbsp;- ③为什么只截分母：假设选项差距大，则 32345/26189 转化为 32345/26，首位商 1；如果分子也截位转化为 32/26，首位商 1，与前面的计算没有区别，并且分子需要补 0，还会造成结果的不准确，所以一步除法只截分母。</dd>
                                    <dd>&nbsp;&nbsp;- ④截分子的情况：比如 32345678/26189，假设选项差距大，一般只截分母，分母截两位为 26，但是分子没必要抄那么多数，一般计算出前两位就可以确定答案了，此时可以有选择性的对分子进行截位，保留 3～4 位即可。</dd>
                                    <dd>（2）多步除法：连除或者连乘，，比如：A/B*（C/D）、A/B÷（C/D）、A/B÷C，此时分子、分母都需要截位，然后约分、化简。</dd>
                                </dl>
                            </div>
                            <div class="border-radius">
                                <dl class="outline">
                                    <dt>【注意】截位直除：</dt>
                                    <dd>1.截谁：</dd>
                                    <dd>（1）一步除法：建议只截分母。</dd>
                                    <dd>（2）多步计算：建议上下都截。</dd>
                                    <dd>2.截几位：看选项差距。</dd>
                                    <dd>（1）选项差距大，截两位：</dd>
                                    <dd>&nbsp;&nbsp;- ①选项首位不同。</dd>
                                    <dd>&nbsp;&nbsp;- ②首位相同，次位差大于首位。</dd>
                                    <dd>（2）选项差距小，截三位：首位相同且次位差小于等于首位。</dd>
                                    <dd>3.步骤：看式子（截谁）→判选项（差距大：两位；差距小：三位）→再计算（不做硬算小笨蛋）。</dd>
                                </dl>
                            </div>
                            <div class="border-radius">
                                <dl class="outline">
                                    <dt>【注意】</dt>
                                    <dd>1.选项存在约 10 倍、100 倍等倍数关系时，保留位数进行截位。</dd>
                                    <dd>2.原来是几位数截位之后仍为几位数。比如：14%截两位为 0.14（截后补小数点、不够位数补零）。</dd>
                                    <dd>3.两组之间首数不同，只需截 2 位，每组中有 10、100、1000……等倍数关系，保留小数点和“0”。</dd>
                                    <dd></dd>
                                    <dd>选项之间没有 10 倍关系，不需要看小数点。</dd>
                                </dl>
                                <dl class="outline">
                                    <dt>【知识点】多步计算：同截分子、分母，好约分。</dt>
                                </dl>
                                <dl class="outline">
                                    <dt>【知识点】截位直除就是找到数字是多少，具体是几十、几百是没有关系的。</dt>
                                </dl>
                            </div>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>截位直除</span>
                            </div>
                            <el-tree :data="summary.d1" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、分数比较</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <dl class="outline">
                                    <dt>【知识点】分数比较：</dt>
                                    <dd>1.一大一小，直接看：分子大的分数大。</dd>
                                    <dd>&nbsp;&nbsp;- ①例：253/31 和 677/22 比大小，分子和分子比大小，677 大，分母和分母比大小，22 小，677/22 的分子大、分母小，所以分数值大，253/31＜677/22。</dd>
                                    <dd>&nbsp;&nbsp;- ②逻辑推导：有一个搭桥的过程。分子相同，分母小的分数大，所以 253/31＜253/22；分母相同，分子大的分数大，253/22＜677/22。所以 253/31＜677/22，253/31 是桥梁。如果做题时每次都想桥梁会影响速度，知道原理，考试时直接想结果。</dd>
                                    <dd></dd>
                                    <dd>2.同大同小：</dd>
                                    <dd>（1）竖着直接除。例：253/22 和 677/31 比大小。分子 253 小，分母 22 小，所以 253/22 的分子小、分母也小。竖着除：253/22=10+，677/31=20+，所以 253/22＜677/31。</dd>
                                    <dd>（2）横着看速度：谁快谁牛气，慢的看成 1。</dd>
                                    <dd>&nbsp;&nbsp;- ①例：253/22 和 677/44 比大小。分子分母同大同小，竖着直接除，
                                        253/22=10+，677/44=10+，竖着直除结果都是十几的数，可以横向比较。横着看
                                        速度，速度指的是变化倍数：分子 253 到 677，变化 2 倍多；分母 22 到 44，变
                                        化刚好 2 倍。所以分子变化快，也就是分子变化速度快，分母变化速度慢，谁快
                                        谁牛气，慢的看成 1，分母变化慢，将分母通通看成 1，253/1＜677/1，所以 253/22
                                        ＜677/44。
                                        </dd>
                                    <dd>&nbsp;&nbsp;- ②横向比较的本质是分母化同思路：如果将分母化统一，253/22 的分母变
                                        成 44，保证分数值不变，需要分子分母同时乘以 2，转化为（253*2）/44，分母
                                        相同，直接比较分子，分母无论是几，都看成 1 即可。</dd>
                                    <dd>（3）横竖哪个好看看哪个（倍数关系明显）。</dd>
                                    <dd></dd>
                                    <dd>3.理论示例：</dd>
                                    <dd>（1）45.1/372.6 和 47.2/369.3。</dd>
                                    <dd>&nbsp;&nbsp;- 答：分子比较，47.2 大；分母比较，369.3 小。出现一大一小，分子大的分
                                        数大，45.1/372.6＜47.2/369.3。</dd>
                                    <dd>（2）45.1/372.6 和 138.6/765.4</dd>
                                    <dd>&nbsp;&nbsp;- 答：分子 138.6 大，分母 765.4 大，分子分母同大同小（分子大的分数值也
                                        大），可以横向看（也可以竖着直接除），分子 45.1 到 138.6 变化 3 倍多，分母
                                        372.6 到 765.4 变化 2 倍多，分子变化快，谁快谁牛气，慢的看成 1，分母都看
                                        成 1，45.1/1＜138.6/1，所以 45.1/372.6＜138.6/765.4。</dd>
                                    <dd>（3）45.1/372.6 和 89.3/765.4。</dd>
                                    <dd>&nbsp;&nbsp;- 答：分子 89.3 大，分母 765.4 大，分子分母同大同小，可以横向看，分子
                                        45.1 到 89.3 变化接近 2 倍，分母 372.6 到 765.4 变化 2 倍多，分子变化慢，分
                                        母变化快，慢的看成 1，1/372.6＞1/765.4，所以 45.1/372.6＞89.3/765.4。</dd>
                                    <dd>（4）45.1/372.6 和 64.9/396.7。</dd>
                                    <dd>&nbsp;&nbsp;- 答：分子 64.9 大，分母 396.7 大，分子分母同大同小。</dd>
                                    <dd>&nbsp;&nbsp;- ①可以横着看，分子 45.1 到 64.9 变化 1 倍多，分母 372.6 到 396.7 变化也
                                        是 1 倍多，倍数关系不明显改为竖着除，45.1/372.6≈1/8，64.9/396.7≈
                                        65/390=1/6，1/8＜1/6，所以 45.1/372.6＜64.9/396.7。
                                        </dd>
                                    <dd>&nbsp;&nbsp;- ②横向也可以看出结果，分子 45.1 到 64.9 变化约 1.5 倍，分母 372.6 到396.7 变化不到 1.1 倍。分子变化快，分母变化慢，慢的看成 1，45.1/1＜64.9/1，
                                        45.1/372.6＜64.9/396.7。可以通过增长率（明天内容）推出结果，45.1 到 64.9
                                        增长约 50%，分母 372.6 到 396.7 增长 10-
                                        %。</dd>
                                </dl>
                            </div>
                            <div class="border-radius">
                                <dt>【注意】分数比较：</dt>
                                <dd>1.一大一小直接看：</dd>
                                <dd>（1）根据分子比大小。</dd>
                                <dd>（2）分子大的分数大，分子小的分数小。</dd>
                                <dd>2.同大同小比速度：</dd>
                                <dd>（1）竖着直接除。</dd>
                                <dd>（2）横着看速度。</dd>
                                <dd>（2）横竖哪个好看看哪个。</dd>
                            </div>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>分数比较</span>
                            </div>
                            <el-tree :data="summary.d2" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>
                    </div>
                </div>
            </div>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s2')">第二节  材料阅读</h3>
                <div class="section-c" v-show="sectionOpen.s2">
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、文字材料</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】文字材料：字数比较稠密，有些同学看着会比较难受，要先进行分段，做题前用 10 秒钟左右的时间找到每个段落的重点。</p>
                                <p>1.三要素（重点）：时间、主体、数据。</p>
                                <p>2.做题和逛商场一样，先看楼层介绍，吃饭要找到美食天地，买男士衣服要找到绅士馆，女士衣服要找到淑女馆，买化妆品要找到美妆馆，逛商场要根据楼层索引找到地方，材料就是根据三要素建立索引。</p>
                                <p>3.文字材料——找主体（关键词）。</p>
                                <p>（1）时间：材料中所有时间。</p>
                                <p>（2）主体（关键词）：数据、单位、变化、联系。</p>
                                <p>（3）操作：5～10 秒内，圈出每段关键词。</p>
                                <p>（4）关键词：要与众不同的，方便定位。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、图表材料</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】图表材料：找数简单很多，但要注意不要看串行，可以用尺子比着看。</p>
                                <p>1.表头：</p>
                                <p>（1）时间：年份、月份、时间段。</p>
                                <p>（2）主体：有无“标志性”词语。</p>
                                <p>2.图例：主体——量（是今年还是去年，深色柱子还是浅色柱子）、率（环比还是同比）。</p>
                                <p>3.单位：是否一致。例：给出铁路、公路、水运、民航等多种运输方式。铁路、公路、水运承载量比较大，民航的承载量比较小，可能是铁路 30、公路 20、水运 1、民航 500，从数字上看民航比较大，但要注意单位，通常都是 30 亿、20亿、1 亿、500 万，民航最小。</p>
                                <p>4.备注：对材料的解释、补充。有注释一定要看注释，有时候是帮助解决概念问题，有时候是帮助解决公式问题，都是大家不常见的东西。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">三、综合材料</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】综合材料：既有文字，又有图表的材料。</p>
                                <p>【注意】快速找数：</p>
                                <p>1.文字材料：</p>
                                <p>（1）标记段落主题词，与题干进行匹配。</p>
                                <p>（2）注意相近词、时间、单位等。</p>
                                <p>2.表格材料：横纵标目、标题、单位、备注。</p>
                                <p>3.图形材料：标题、单位（人口出生率死亡率一般都是‰）、图例。</p>
                                <p>4.综合材料：不同类型材料之间的关系、材料结构。</p>
                            </div>
                        </div>
                    </div>
                </div>
                <el-card class="summary" v-show="sectionOpen.s2">
                    <div slot="header" class="clearfix">
                        <span>材料阅读</span>
                    </div>
                    <el-tree :data="summary.d3" :props="defaultProps" default-expand-all></el-tree>
                </el-card>
            </div>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s3')">第三节 基期与现期</h3>
                <div class="section-c" v-show="sectionOpen.s3">
                    <div class="border-radius">
                        <p>基本术语：</p>
                        <p>基期量与现期量</p>
                        <p>资料分析中常涉及两个量的比较，作为对比参照的时期称为基期，对应的量称为基期量；而相对于基期的时期称为现期，所对应的量称为现期量。</p>
                        <p>增长量与增长率</p>
                        <p>增长量：用来表述基期量与现期量变化的绝对量。</p>
                        <p>增长率：用来表述基期量与现期量变化的相对量。</p>
                        <p>同比与环比</p>
                        <p>同比：一般与上年同一时期相比较。</p>
                        <p>环比：与相邻的上一个时期相比较。</p>
                        <p></p>
                        <p>【知识点】基期与现期：作为对比参照的是基期，而相对于基期比较的是现期。</p>
                        <p>1.现期与基期，考试中 90%都用时间作为区分。例：2020 年我的体重 120斤，2019 年我的体重 100 斤。2020 年是现在的时间，2019 年是过去的时间，所以 2020 年为现期，2019 年为基期。要有时间轴概念，如果给 2019 年，求 2017、2012 年，向 2019 年左侧推就是基期；现期是未来的、没有发生的事情，给 2019年，求 2020 年，向 2019 年右侧推就是求现期。</p>
                        <p>2.2020 年比 2019 年增长了 20 斤（增长量），增长的具体值就是增长量。增长量=现在-过去=现期- 基期=120-100=20 斤。</p>
                        <p>3.2020 年比 2019 年增长 20%（增长率）。增长率（rate）就是增长的比例，用 r 表示，增长率=增长量/基期量=（现期量- 基期量）/基期量=（120-100）/100=20%。增长量和增长率问题下节课具体讲。</p>
                        <p>4.有一种特殊表述：比如马云比我有钱，作为对比参照的是基期，“我”就是基期，“马云”就是现期；再比如我比马云帅，马云作为对比参照，所以“马云”就是基期，“我”就是现期。对比型题目总结：“比”字后面是基期，出现“A比 B……”，B 是基期，A 是现期。</p>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、基期量</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】基期量：</p>
                                <p>1.题型识别：给现在，求以前某时期的值。做题第一步先确定时间，圈出时间，问题时间在材料之前，比如材料给 2019 年，问 2018 年或者 2017年，求以前的时间（通过时间去区分），就是基期。</p>
                                <p>2.计算公式：基期量=现期-增长量（最简单）。比如现在体重 120 斤，比过去增长了 20 斤，过去就是 120-20=100 斤。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】资料分析中加减做差的问题，选项精度和材料精度保持一致时，可以用尾数法解题。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】基期量：</p>
                                <p>1.题型识别：给现期，求前面某个时期的值。</p>
                                <p>2.列式：</p>
                                <p>（1）给现期量和增长量：基期量=现期量-增长量（尾数法、估算）。</p>
                                <p>（2）给现期量和增长率：基期量=现期量/（1+r）（今天的重点）。</p>
                                <p>3.速算：r 为 rate，代表增长率。</p>
                                <p>（1）|r|＞5%，截位直除。</p>
                                <p>（2）|r|≤5%（选项差距小），化除为乘（后面会讲到）。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】同比与环比：</p>
                                <p>1.同比：与上年同期相比。比如 2019 年的 7 月同比对应的是 2018 年 7 月；2019 年一季度同比对应的是 2018 年一季度。</p>
                                <p>2.环比：与紧紧相邻的上一统计周期相比（月不环比、季度环比）。环比类似于“铁链子”，环环相扣。比如 2019 年 7 月的环比，7 月的“上一环”是 6 月，环比对应的是 2019 年 6 月；2019 年一季度的环比，一季度的“上一环”是四季度，环比对应的是 2018 年四季度。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】一旦增长率比较小的时候，除起来很麻烦，可以用化除为乘计算。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】化除为乘：</p>
                                <p>1.应用：求基期，选项差距小，|r|≤5%。</p>
                                <p>2.方法：A/（1-r）≈A+A*r；A/（1+r）≈A-A*r。A 为现期量。</p>
                                <p>3.推导：分子分母同时乘以（1+r），分数值不变，A/（1-r）=A*（1+r）/[（1+r）*（1-r）]，根据平方差公式（a+b）*（a-b）=a²-b²，可以得到：（1+r）*（1-r）=1-r²，原式=（A+A*r）/（1-r²）。当|r|≤5%，r²=5%²=0.05²=0.0025，1-0.0025≈1，因此（A+A*r）/（1-r²）≈（A+A*r）/1=A+A*r。</p>
                                <p>同理：A/（1+r）=A*（1-r）/[（1+r）*（1-r）]=A*（1-r）/（1-r²）≈A-A*r。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】基期和差：</p>
                                <p>1.以坑治坑：先观察现期坑，排除；再看大小关系，选择。</p>
                                <p>2.截位直除：60%以上的基期和差类问题，都可以用以坑治坑的思路做，但也不是 100%能用，如果以坑治坑，不好用了，再去截位直除。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、现期量</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】现期量：</p>
                                <p>1.题型识别：给现在，求后面某时间的值。考试 80%都是基期计算，剩下 20%才是极个别的现期计算，所有的现期问题是基期的翻版。比如 2020 年体重是 120斤，按照同样的增长标准，问 10 年之后的体重。</p>
                                <p>2.计算公式：</p>
                                <p>（1）现期量=基期量+增长量。</p>
                                <p>（2）现期量=基期量*（1+增长率）。</p>
                                <p>3.举例</p>
                                <p>（1）示例 1：2016 年产值为 100 万，2017 年比 2016 年多 50 万，则 2017年产值为多少？</p>
                                <p>&nbsp;&nbsp;- 答：给 2016 年，问未来的 2017 年，即时间轴右侧的 2017 年，求现期。现期=基期+增长量=100+50=150。</p>
                                <p>（2）示例 2：2016 年产值为 100 万，2017 年比 2016 年增长了 50%，则 2017年产值为多少？</p>
                                <p>&nbsp;&nbsp;- 答：给了基期和增长率，2017 年=2016 年*（1+r）=100*（1+50%）。</p>
                            </div>
                        </div>
                    </div>
                    <div class="border-radius">
                        <p>【注意】基期与现期：</p>
                        <p>1.基期量：</p>
                        <p>（1）识别：求前面某个时期的量。</p>
                        <p>（2）公式：基期量=现期量-增长量，基期量=现期量/（1+r）。</p>
                        <p>（3）速算：r 大截位直除，r 小化除为乘。</p>
                        <p>（4）基期和差：先用现期和正负排除再计算。</p>
                        <p>2.现期量：</p>
                        <p>（1）识别：求后面某个时期的量。</p>
                        <p>（2）公式：现期量=基期量+增长量；现期量=基期量*（1+r）。</p>
                        <p>（3）速算：截位计算，特殊数字。</p>
                        <p>3.注意：今天的重点是计算（截位直除）、比较（分数比较）和基期与现期。</p>
                    </div>
                </div>
                <el-card class="summary" v-show="sectionOpen.s3">
                    <div slot="header" class="clearfix">
                        <span>基期与现期</span>
                    </div>
                    <el-tree :data="summary.d4" :props="defaultProps" default-expand-all></el-tree>
                </el-card>
            </div>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s4')">第四节 一般增长率</h3>
                <div class="section-c" v-show="sectionOpen.s4">
                    <div class="border-radius">
                        <p>基本术语：</p>
                        <p>增长率</p>
                        <p>增长率是用来表述基期量与现期量变化的相对量。增长率又称增速、增幅或增长幅度、增值率等。增长率为负时表示下降，下降率也可直接写成负的增长率。</p>
                        <p>百分数与百分点</p>
                        <p>百分数：用来反映量之间的比例关系。</p>
                        <p>百分点：用来反映百分数的变化。</p>
                        <p>增长率与倍数</p>
                        <p>增长率指比基数多出的比率；倍数指两数的直接比值。</p>
                        <p>若 A 是 B 的 n 倍，则 n=r+1（r 指 A 与 B 相比的增长率）。</p>
                        <p>成数与翻番</p>
                        <p>成数：几成相当于十分之几。</p>
                        <p>翻番：翻一番为原来的 2 倍；翻两番为原来的 4 倍；依次类推，翻 n 番为原来的 2<sup>n</sup>倍。</p>
                        <p>增幅、降幅与变化幅度</p>
                        <p>增幅一般就是指增长率，有正有负。</p>
                        <p>降幅指下降的幅度，降幅比较大小时，前提必须为下降。</p>
                        <p>变化幅度指增长或下降的绝对比率，变化幅度比较大小时用增幅（降幅）的绝对值。</p>
                    </div>
                    <div class="border-radius">
                        <p>【知识点】常见词语辨析：</p>
                        <p>1.“百分数”与“百分点”：</p>
                        <p>（1）百分数表示两个量的比例关系，用除法计算。</p>
                        <p>（2）百分点表示百分数的变化（差值），用加减法计算。</p>
                        <p>（3）考查形式：给出一个百分数和百分点，求另一个百分数。出现百分点，考虑百分数的加减计算。</p>
                        <p>（4）补例：</p>
                        <p>&nbsp;&nbsp;- ①甲班共有 50 人，女生人数 30 人，问女生占全班人数的比重？</p>
                        <p>&nbsp;&nbsp;- 答：女生/全班=30/50=60%，60%是一个百分数，是用除法得到的</p>
                        <p>&nbsp;&nbsp;- ②2017 年某地区小麦产量同比增长率为 8%，较玉米产量的增长率低了 5 个百分点，则 2017 年该地区玉米产量的增长率为？</p>
                        <p>&nbsp;&nbsp;- 答：小麦增长率比玉米低 5 个百分点，即玉米增长率-小麦增长率=5 个百分点，已知小麦增长率为 8%，则玉米增长率为 13%。</p>
                        <p></p>
                        <p>2.“增长率”与“倍数”：增长率指比基数多出的比率；倍数指两数的直接比值。比如 2 是 1 的 2 倍（“真”倍数，直接除），2 比 1 多/增加（2-1）/1=1倍（“假”倍数，本质上是增长率，先减再除）。</p>
                        <p>（1）A 是 B 的多少倍？倍数=A/B。</p>
                        <p>（2）A 比 B 多/增长多少（%）？增长率=（A-B）/B=A/B-1。</p>
                        <p>（3）A/B=（A/B-1）+1，即倍数=增长率+1。例：150 是 100 的 1.5 倍；150比 100 多（150-100）/100=0.5 倍，即增长率为 50%。</p>
                        <p>（4）高频易错点：</p>
                        <p>&nbsp;&nbsp;- ①2019 年比 2018 年增长了 300%。增长率为 300%，即增长了 3 倍，则 2019年是 2018 年的 4 倍。</p>
                        <p>&nbsp;&nbsp;- ②2019 年比 2018 年增长了 2 倍。增长率为 2=200%，则 2019 年是 2018 年的 3 倍。</p>
                        <p>&nbsp;&nbsp;- ③2019 年比 2018 增长了 3/10。增长率为 3/10=0.3=30%，则 2019 年是 2018 年的 3/10+1=13/10=1.3 倍。</p>
                        <p>&nbsp;&nbsp;- ④思考：2019 年比 2018 年增长了 1.8 倍，2019 年是 2018 年的（ ）倍？</p>
                        <p>&nbsp;&nbsp;- 答：增长了 1.8 倍，说明增长率为 1.8=180%，则 2019 年是 2018 年的 2.8倍。</p>
                        <p></p>
                        <p>3.成数、翻番：</p>
                        <p>（1）成数：几成相当于十分之几。三成是 3/10=30%，五成是 5/10=50%；三成多为 30%～40%，如果计算出来是 40<sup>+</sup>%，则不能称之为三成多。</p>
                        <p>（2）翻番：翻一番为原来的 2 倍；翻两番为原来的 4 倍；以此类推，翻 n 番为原来的 2<sup>n</sup>倍。比如斗地主，假设底分为 10000，“抢地主”底分乘 2，“炸弹”再乘 2，“王炸”再乘 2，10000*2*2*2。</p>
                        <p></p>
                        <p>4.“增幅”“降幅”“变化幅度”：</p>
                        <p>（1）增幅（增长率）：可正可负，带符号比。增幅=r=增长速度=增速，只是字不一样，本质上没有区别。如果增长率为 10%，那么增幅就是 10%；如果增长率为-5%，那么增幅就是-5%。</p>
                        <p>（2）降幅：必须为负，比较绝对值。如果 r=-10%，则降幅为 10%，“降”就代表负号；如果 r=-5%，则降幅为 5%。如果 r=20%，则没有降幅的说法</p>
                        <p>（3）变化幅度：可正可负，比较绝对值。变化幅度即增长率的绝对值，如果 r=10%，则变化幅度是 10%；如果 r=-10%，则变化幅度也是 10%。</p>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、计算</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】一般增长率：</p>
                                <p>1.计算类：题目给出百分点的变化，求增长率，用加减计算。</p>
                                <p>2.比较类。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】高频易错点（高减低加）：</p>
                                <p>1.2017 年收入 10 万元，同比增长 10%，增速比去年提高 5 个百分点。则 2016 年的增长率为？</p>
                                <p>答：比如我今年有 10 元钱，比去年多 5 元，说明去年更低。同理，增速比去年高，则去年更低，用减法，2016 年增长率为 10%-5%=5%。出现“提高/上升”用减法。</p>
                                <p>2.2017 年收入 10 万元，同比增长 10%，增速比去年回落 5 个百分点。则 2016 年的增长率为？</p>
                                <p>答：回落即掉落，增速比去年低，说明去年更高，用加法，2016 年增长率为 10%+5%=15%。出现“回落/下降/减少”用加法。</p>
                                <p></p>
                                <p>1.2017 年收入 10 万元，同比下降 10%，降幅比去年扩大 5 个百分点。则 2016 年的降幅为？增长率为？</p>
                                <p>答：2017 年同比下降 10%，即降幅为 10%，降幅比去年扩大，高减低加，“扩大”用减法，则 2016 年降幅为 10%-5%=5%，转化成增长率为-5%。可以画图理解，从-5%到-10%，亏得越来越多，是降幅扩大</p>
                                <p>2.2017 年收入 10 万元，同比下降 10%，降幅比去年收窄 5 个百分点。则 2016 年的降幅为？增长率为？</p>
                                <p>答：收窄即变小、变窄，是降低的意思。2017 年降幅为 10%，降幅比去年收窄，高减低加，“收窄”用加法，则 2016 年降幅为 10%+5%=15%，转化成增长率为-15%。可以画图理解，从-15%到-10%，亏得越来越少，是降幅收窄。</p>
                                <p>3.“增速”直接带符号，用“高减低加”正常做。“降幅”先不带符号算降幅，后面再添“负号”。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】计算类：给具体量（现期量、基期量、增长量）。</p>
                                <p>1.识别：增长/下降+%、几成；增长速度、增长幅度。</p>
                                <p>2.公式：r=增长量/基期量=增长量/（现期-增长量）=（现期- 基期）/基期，公式之间是相通的。</p>
                                <p>（1）最本质的公式：r=增长量/基期量。比如现在体重为 120 斤，过去体重为 100 斤，说明增长了 20 斤，增长率为 20/100=20%。</p>
                                <p>（2）已知增长量和现期：r=增长量/（现期-增长量）。</p>
                                <p>（3）已知现期和基期：r=（现期- 基期）/基期。</p>
                                <p>3.速算：截位直除或估算。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】若不喜欢减法，则可以求（现期- 基期）/基期＞10%，现期- 基期＞基期 *10% ， 现 期 ＞ 1.1* 基 期 ， 一 个 数 乘 以 1.1 考 虑 错 位 相 加 ， 如 1127.6*1.1=1127.6*（1+10%）=1127.6+112.76。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】小结：</p>
                                <p>1.给现期和基期，正常做除法。</p>
                                <p>2.给出百分点，考虑百分数加减计算。</p>
                                <p>3.问固定某几年的增长率超过百分之几，考虑对公式进行优化，化繁为简，解题的目的不是当计算器，而是解决问题。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、比较</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】增长率比较：</p>
                                <p>1.识别：增长最快（增长率找最大）/增长最慢（增长率找最小）；增速最快/最慢，增长率最高/最低。</p>
                                <p>2.比较方法：r=增长量/基期量（基础公式，计算出增长量，再除以基期量，最后比较大小）=（现期- 基期）/基期=现期/基期- 基期/基期=现期/基期-1。假设第一个主体的现期为 A1，基期为 B1，第二个主体的现期为 A2，基期为 B2，则第一个主体的增长率=A1/B1-1，第二个主体的增长率=A2/B2-1，大家都有-1，则-1可以不看，直接比较“现期量/基期量”，“现期量/基期量”越大，增长率越大。</p>
                                <p>（1）当现期/基期≥2，倍数关系明显，用“现期量/基期量”比较，“现期量/基期量”越大，增长率越大。</p>
                                <p>（2）当现期/基期=1<sup>+</sup>，倍数关系不明显，用“增长量/基期量”比较，“增长量/基期量”越大，增长率越大。</p>
                                <p>3.例：问（2012～2015）哪一年的同比增速最快？</p>
                                <el-row :gutter="20">
                                    <el-col :span="12"><div class="my-echarts" id="echart01"></div></el-col>
                                    <el-col :span="12"><div class="my-echarts" id="echart02"></div></el-col>
                                </el-row>
                                <p>（1）同比增速最快即增长率比较大小，已知每一年的现期和基期，当“现期/基期”倍数关系明显，用“现期量/基期量”比较，当“现期/基期”倍数关系不明显，用“增长量/基期量”比较。</p>
                                <p>（2）左图：现期/基期，2012 年：426/133=3<sup>+</sup>，2013 年：866/426=2<sup>+</sup>，2014年：1600/866=2<sup>-</sup>，2015 年：1800/1600=1<sup>+</sup>，“现期/基期”倍数关系明显，用“现期量/基期量”比较，“现期量/基期量”越大，增长率越大，则 2012 年最快。</p>
                                <p>（3）结论：资料分析中斜率没有意义，左图的 2013 年到 2014 年的斜率最大，斜率=△y/△x，横轴是年份，没有意义，故斜率在柱状图中没有意义。假设数值分别为 100、200、300，斜率相同，增长率分别为 100%、50%，故斜率和增长率无关。</p>
                                <p>（4）右图：现期/基期，2012 年：213/133=1<sup>+</sup>，2013 年：279/213=1<sup>+</sup>，2014年：349/279=1<sup>+</sup>，2015 年：409/349=1<sup>+</sup>，倍数关系不明显，不能通过观察秒杀，用“增长量/基期量”比较。2012 年：（213-133）/133=80/133；2013 年：（279-213）/213=66/213；2014 年：（349-279）/279=70/279；2015 年：（409-349）/349=60/349。80/133 的分子最大、分母最小，一大一小直接看，看不出倍数考虑做差，说不定能秒出结果，同比增速最快是 2012 年。</p>
                            </div>
                        </div>
                    </div>
                </div>
                <el-card class="summary" v-show="sectionOpen.s4">
                    <div slot="header" class="clearfix">
                        <span>一般增长率</span>
                    </div>
                    <el-tree :data="summary.d5" :props="defaultProps" default-expand-all></el-tree>
                </el-card>
            </div>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s5')">第五节 增长量</h3>
                <div class="section-c" v-show="sectionOpen.s5">
                    <div class="border-radius">
                        <p>基本术语：</p>
                        <p>增长量是用来表述基期量与现期量变化的绝对量，增长率则是用来表述两者变化的相对量。</p>
                        <p>年均增长量=（现期量-基期量）÷年份差。</p>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、计算</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】增长量：</p>
                                <p>1.识别：增长+具体单位。</p>
                                <p>（1）增长量有具体单位描述，比如今年增加 200 人、今年增加 200 元。</p>
                                <p>（2）区分：增长+%→增长率；增长+具体单位→增长量。</p>
                                <p>2.例：2017 年比 2016 年增加了多少亿元。</p>
                                <p>3.计算公式：增长量=现期- 基期=基期*r=现期/（1+r）*r。</p>
                                <p>4.比如现在是 120 斤，过去是 100 斤，增长了 120-100=20 斤。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】年均增长量：</p>
                                <p>1.识别：年均+增长+单位。</p>
                                <p>2.年均增长量=（现期量- 基期量）/年份差。比如老师大学四年共增长了 20 斤，则平均每年增长了 20/4=5 斤。</p>
                                <p>3.年均增长类问题年份差的选择：</p>
                                <p>（1）一般情况（除江苏外）：2011 年～2015 年：年份差 n=2015-2011=4。基期：2011 年；现期：2015 年。除了江苏省考，其他所有地方方法都一样（包括国考）。</p>
                                <p>（2）江苏省考：2011 年～2015 年：年份差为 5（基期往前推一年）；基期：2010 年；现期：2015 年。江苏出题人的标准不同，只要不是参加江苏省考的同学，不需要记，如果题库刷题遇到，可以跳过，或者按照基期往前推一年计算。</p>
                                <p>（3）五年规划（全国都一样）：“十二五”期间（2011～2015 年）：年份差为 5（基期往前推一年）；基期：2010 年；现期：2015 年。五年规划，所有地区都相同，不论什么考试，都是一样的。比如“十三五”期间（2016～2020 年），现期是 2020 年，基期前推一年是 2015 年。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】</p>
                                <p>1.本题如果一个一个计算，中间会约掉，这种题目，找到现期和基期代公式即可。</p>
                                <p>2.年均增加值，通常增加值是专有名词，可以理解为 GDP，和增长量无关，但是本题只能理解为增长量，否则没有答案。</p>
                                <p>3.如果依次计算 2012 年-2011 年、2013 年-2012 年、2014 年-2013 年、2015年-2014 年，四年的增长量加和，中间会约掉，最后只有 2011 年和 2015 年，因此这种题目找到现期和基期计算即可。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】</p>
                                <p>1.所有的五年规划，年份差都是 5。</p>
                                <p>2.给“十一五”，基期需要前推，如果是正常的时间段，不需要前推，和题目的数据无关。</p>
                                <p></p>
                                <p>【知识点】已知现期、增长率，求增长量，方法是百化分。</p>
                                <p>1.公式：增长量=现期/（1+r）*r。现期/（1+r）=基期，基期*r=增长量。公式不需要记，考试基本不会用。</p>
                                <p>2.2019 年总收入是 10 万元，同比增长 33.3%。求：2019 年与 2018 年相比总收入增长了多少万元？分析：</p>
                                <p>（1）求增长量，如果用增长量=现期/（1+r）*r 计算，增长量=10/（1+33.3%）*33.3%，计算很麻烦。</p>
                                <p>（2）33.3%≈1/3，原式≈10÷（1+1/3）*1/3=10/（1+3）=2.5</p>
                                <p>（3）增长量计算的核心是如何巧妙的把百分数转化为分数的形式——百化分。</p>
                                <p>3.结论：</p>
                                <p>（1）增长率百化分，|r|=1/n。</p>
                                <p>（2）r＞0 时，增长量=现期/（n+1）；r＜0 时，减少量=现期/（n-1）。n 为百化分的分母。</p>
                                <p>（3）推导：</p>
                                <p>&nbsp;&nbsp;- ①r＞0 时：r 是百分数，一定可以转化为 1/n 的形式，增长量=现期/（1+r）*r=现期÷（1+1/n）*（1/n）=现期/（n+1）。</p>
                                <p>&nbsp;&nbsp;- ②r＜0 时，r=-1/n，增长量=现期÷（1-1/n）*（-1/n）=-现期÷（1-1/n）*1/n→增长量=-现期/（n-1），可以表述为减少量=现期/（n-1），“减少”相当于“-”。</p>
                                <p>4.例：2019 年总收入是 10 万元，同比下降 33.3%。求：2019 年与 2018 年相比总收入减少了多少万元？</p>
                                <p>答：“下降 33.3%”，r＜0，转化为分数是-1/3，减少量=现期/（n-1）=10/（3-1）=5。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】百化分：</p>
                                <p>1.百化分表格：</p>
                                <p>（1）1/2=50%，1/4=25%，1/8=12.5%，1/16=6.25。</p>
                                <p>（2）1/3≈33.3%，1/6≈16.7%，1/12≈8.3%。</p>
                                <p>（3）1/5=20%，1/10=10%，1/20=5%。</p>
                                <p>（4）1/7≈14.3%，1/14≈7.1%。</p>
                                <p>（5）1/9≈11.1%，1/11≈9.1%。</p>
                                <p>（6）1/13≈7.7%，1/15≈6.7%。</p>
                                <p>（7）1/17≈5.9%，1/18≈5.6%，1/19≈5.3%。</p>
                                <p>2.百化分记忆方法：</p>
                                <p>（1）1/2、1/4、1/5、1/10、1/20 属于常识，不需要记忆。</p>
                                <p>（2）1/4、1/8、1/16 是一半的关系，因此百分数也是一半的关系。</p>
                                <p>（3）1/3、1/6、1/12 是一半的关系，因此百分数也是一半的关系。</p>
                                <p>（4）1/7≈14.3%、1/14≈7.1%和 1/9≈11.1%、1/11≈9.1%可以成对记忆。</p>
                                <p>（5）1/13 和 1/15 需要死记硬背。</p>
                                <p>（6）1/17、1/18、1/19 对应 5.（9、6、3）%，是等差数列。5.9%最大，对应 1/17，5.3%最小，对应 1/19，5.6%在中间，对应 1/18。</p>
                                <p>（7）比如考试考 12.5%，可以想到是 1/8；百分数和分母可以相互对调，遇到 8%，是 1/12.5。因 1/8=12.5%=12.5/100→1/12.5=8/100=8%，是交叉对应的关系。</p>
                                <p>3.增长率百化分之倍数转化。利用与背过的百分数的倍数关系，实现百化分。</p>
                                <p>（1）2.5%=？25%/10=2.5%，则 2.5%=1/4÷10=1/40。</p>
                                <p>（2）67%=？6.7%=1/15，则 67%=1/15*10=1/1.5（分子一定要转换为 1 的形式）。或者看 67%≈33.3%*2≈2/3=1/1.5。</p>
                                <p>（3）22%=？因 11%=1/9，22%=2/9=1/4.5。</p>
                                <p>4.增长率百化分之取中法，如果遇到百分数左右难取舍，且选项接近，取中即可。比如 22%在 20%（1/5）和 25%（1/4）之间，可以取中为 1/4.5，是比较精确的方法，选项接近的时候，能取中尽量取中，可以提高精度。</p>
                                <p>（1）18.5%=？在 16.7%（1/6）和 20%（1/5）之间，取 1/5.5。</p>
                                <p>（2）28.7%=？在 25%（1/4）和 33.3%（1/3）之间，取 1/3.5。</p>
                                <p>5.增长率百化分之公式法，如果遇到百分数实在想不起来，或者你就不想背，那么请记住：N=100÷百分号前的数字（保留小数点后一位）。</p>
                                <p>（1）57%=？如果想不到 57%≈56%，5.6%≈1/18，则 57%≈1/1.8。可以用100/57，结果是 18 开头，则是 1/1.8，不需要除得很精确，保留小数点后一位即可。</p>
                                <p>（2）37%=？100/37，结果近似是 2.7，为 1/2.7。</p>
                                <p>（3）73%=？100/73≈1.3，为 1/1.3。不建议大家除，提前背可以节省时间。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、比较</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】增长量比较：</p>
                                <p>1.识别：增长最多/最少、下降最多/最少。增长率比较大小，是问增长最快/最慢。</p>
                                <p>2.题型：</p>
                                <p>（1）给现期量、基期量：增长量=现期量- 基期量。</p>
                                <p>（2）给现期量、r：</p>
                                <p>&nbsp;&nbsp;- ①大大则大。</p>
                                <p>&nbsp;&nbsp;- ②百化分计算，转化为分数比较。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】给现期量、r，比较增长量大小。</p>
                                <p>1.现期量大，同时│r│也大，则其增长量/减少量大。</p>
                                <p>2.一大一小：百化分计算（是 100%正确的方法），转化为分数比较：</p>
                                <p>3.例：</p>
                                <p>（1）引例 1：2017 年，小马有 200 亿，同比增长 25%，小刘有 110 亿，同比增长 10%，则 2017 年谁的增长量大？</p>
                                <p>答：小马比小刘有钱，增速还更快，则小刘永远不会追上小马，小马的增长量大于小刘的增长量，即小马现期、r 都大，则增长量大。</p>
                                <p>（2）引例 2：2017 年，小马有 200 亿，同比下降 25%，小刘有 110 亿，同比下降 10%，则 2017 年谁的减少量大？</p>
                                <p>答：小马现期大、降幅大，则小马减少量大。</p>
                                <p>（3）引例 3：2017 年，小马有 200 亿，同比增长 25%，小刘有 110 亿，同比增长 50%，则 2017 年谁的增长量大？</p>
                                <p>答：现期小马大、增长率小刘大，增长量需要计算。百化分近似估算，小马：25%=1/4，200/（4+1）=40；小刘：50%=1/2，110/3=30+，小马增长量大。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】百化分是 100%正确的方法，看比率、速度、变化都会出现误差。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】增长量：</p>
                                <p>1.计算：</p>
                                <p>（1）识别：增长+单位（人/元/吨）。</p>
                                <p>（2）公式：增长量=现期量- 基期量=基期量*r=现期量/（1+r）*r。</p>
                                <p>（3）速算：</p>
                                <p>&nbsp;&nbsp;- ①百分数化分数：近似转化，取中转化，倍数转化。</p>
                                <p>&nbsp;&nbsp;- ②若|r|≈1/n，增长量=现期量/（n+1）；下降量=现期量/（n-1）。</p>
                                <p>2.比较：</p>
                                <p>（1）识别：增长最多/少。</p>
                                <p>（2）速算：</p>
                                <p>&nbsp;&nbsp;- ①给出每年数据：直接两两相减，柱状图还可以用直尺标注。</p>
                                <p>&nbsp;&nbsp;- ②给出现期量和 r：两者都大则增量必然大，否则百化分计算。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】</p>
                                <p>1.题型：增长+%→增长率；增长+单位→增长量，增长量百化分计算。</p>
                                <p>2.问增长最快/最慢，是增长率的比较；问增长最多/最少，是增长量的大小比较。</p>
                            </div>
                        </div>
                    </div>
                </div>
                <el-card class="summary" v-show="sectionOpen.s5">
                    <div slot="header" class="clearfix">
                        <span>增长量</span>
                    </div>
                    <el-tree :data="summary.d6" :props="defaultProps" default-expand-all></el-tree>
                </el-card>
            </div>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s6')">第六节 比重</h3>
                <div class="section-c" v-show="sectionOpen.s6">
                    <div class="border-radius">
                        <p>基本术语：</p>
                        <p>比重指部分在总体中所占的比率，有时也用贡献率、利润率等表述方式。</p>
                        <p>增长贡献率指部分增量在总体增量中所占的比例。</p>
                        <p>资料分析中的利润率特指利润在收入中的占比。</p>
                    </div>
                    <div class="border-radius">
                        <p>【注意】比重：</p>
                        <p>1.现期比重。</p>
                        <p>2.基期比重。</p>
                        <p>3.两期比重比较与计算。</p>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、现期比重</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】现期比重：</p>
                                <p>1.题型识别：……占……的比重。出现“占”，一定是比重问题，注意时间。</p>
                                <p>（1）求比重一般是占前/占后，有的题目是倒装句，如在 A 中 B 的占比，此时是 B/A，注意特殊问法。</p>
                                <p>（2）一共有 500 人，男生为 100 人，女生为 400 人，不能问男生占女生的比重，这句话是不存在的，两个独立的个体不能用占比来表述，比重的前提是有一个包含的关系，只能说男生人数是女生人数的 1/4，或者女生人数是男生人数的 4 倍。</p>
                                <p>2.公式：比重=部分/总体。</p>
                                <p>3.考查形式：</p>
                                <p>（1）已知部分和总体，求比重。</p>
                                <p>例 1：某班总共 500 人，其中男生 100 人，求男生占全班总人数的比重？</p>
                                <p>答：比重=100/500=1/5=20%。</p>
                                <p>（2）已知部分和比重，求总体。</p>
                                <p>例 2：某班男生 100 人，已知男生占全班总人数的 20%，求全班有多少人？</p>
                                <p>答：全班=100/20%=500 人。</p>
                                <p>（3）已知总体和比重，求部分。</p>
                                <p>例 3：某班总共 500 人，已知男生占全班总人数的 20%，求男生有多少人？</p>
                                <p>答：男生人数=500*20%=100 人。</p>
                                <p>4.速算技巧：截位直除。</p>
                                <p>5.概念引申（比重的特殊表述形式）：</p>
                                <p>（1）增长贡献率=部分增量/总体增量。</p>
                                <p>例：2018 年我的家庭收入 20 万元，2017 年 10 万元；其中我自己 2018 年收入 2 万元，2017 年 1 万元，问：我对家庭总收入的增长贡献率？</p>
                                <p>答：增长贡献率=部分增量/总体增量=（2-1）/（20-10）=1/10。</p>
                                <p>（2）利润率=利润/收入。数量关系：利润率=利润/成本；资料分析：利润率=利润/收入。数量关系都是小本买卖，成本非常清晰，小本生意往往用利润率=利润/成本。资料分析是统计整个大行业，成本不好统计，非常复杂，在整个大环境下，往往用收入去统计，即资料分析：利润率=利润/收入。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】饼形图：</p>
                                <p>1.十二点钟方向，顺时针依次排布。</p>
                                <p>2.若有总体，先看部分占总体的特殊比重；若无总体，看各部分之间倍数关系。如东部为 100，西部为 50，东、西部在饼图所占的面积为 2：1 的关系。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、基期比重</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】基期比重：</p>
                                <p>1.题型识别：问题时间在材料之前，占、比重。</p>
                                <p>2.例：2017 年我的家庭总收入 B 万元，同比增长率 b，2017 年我个人收入 A 万，同比增长率 a。求：2016 年我的收入占家庭总收入的比重。</p>
                                <p>答：基期=现期/（1+r），2016 年家庭收入为 B/（1+b），个人收入为 A/（1+a），基期比重=A/（1+a）÷[B/（1+b）]=A/（1+a）*[（1+b）/B]=A/B*[（1+b）/（1+a）]。</p>
                                <p>3.计算公式：A/B*[（1+b）/（1+a）]。A：分子（部分的现期量），B：分母（整体的现期量），a：分子的增长率，b：分母的增长率。</p>
                                <p>4.速算：</p>
                                <p>（1）截位直除。</p>
                                <p>（2）先算现期比重，再看（1+b）/（1+a）大于 1 或小于 1，结合选项排除答案。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】</p>
                                <p>1.右边式子=1.097/1.137，分子小分母大，结果小于 1；如果是 1.137/1.097，分子大分母小，结果大于 1。</p>
                                <p>2.根据“住宅投资占房地产开发投资的比重为 70.8%”，可知 A/B=70.8%。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">三、两期比重</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】两期比重——升降：</p>
                                <p>1.题型识别：两个时间+比重。</p>
                                <p>例：2013 年 1～9 月，苏中工业用电量占江苏省工业用电量的比重与去年相比：</p>
                                <p>A.提高 &nbsp;&nbsp; B.降低 &nbsp;&nbsp; C.不变 &nbsp;&nbsp; D.无法判断</p>
                                <p>答：比较现期比重和基期比重的关系，是提高还是降低还是不变，这种题目就是两期比重。本题 2013 年 1～9 月比去年，去年就是 2012 年 1～9 月，两个时间，出现“占”，判定题型为两期比重问题。</p>
                                <p>2.计算公式：现期比重− 基期比重=A/B-A/B*[（1+b）/（1+a）]=A/B*[（1+a）/（1+a）-（1+b）/（1+a）]=A/B*[（1+a-1-b）/（1+a）]=A/B*[（a-b）/（1+a）]=A/B*1/（1+a）*（a-b）。由于 A/B 一定是正数，当 a＞0，1+a＞0，1/（1+a）＞0；当a＜0，a 不可能小到-100%，即 a＞-100%，则 1+a＞0，1/（1+a）＞0。因此 A/B、1/（1+a）都为正数，此时看 a-b 的大小。</p>
                                <p>3.升降判断：</p>
                                <p>（1）a＞b，比重上升。</p>
                                <p>（2）a＜b，比重下降。</p>
                                <p>（3）a=b，比重不变。</p>
                                <p>（4）a：分子（部分量）的增长率，b：分母（总体量）的增长率</p>
                                <p>4.以下问题现期均为 2019 年，请判定题型。</p>
                                <p>（1）2019 年男生占全班人数的比重是多少？出现“占”，时间为现期，现期比重。</p>
                                <p>（2）2018 年我的收入占全家总收入的比重是多少？出现“占”，时间为基期，基期比重问题。</p>
                                <p>（3）2019 年男生占全班人数的比重比女生高。出现“占”，时间为 2019 年，只有一个时间，现期比重，即男生现期比重和女生现期比重比较大小。</p>
                                <p>（4）2019 年我的收入占全家总收入的比重比上年上升。出现“占”，比重问题，2019 年比上年，有两个时间，两期比重问题。</p>
                                <p>（5）2019 年男生占全班人数的比重比 2010 年高几个百分点？出现“占”，两个时间（2019 年、2010 年），两期比重问题。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】资料分析很少考到地理知识，大家不要在地区上抬杠。表格既然说了东部地区有北京、天津，那就默认里面包含北京、天津。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】两期比重：上升/下降几个百分点：</p>
                                <p>1.题型识别：两个时间+比重+上升/下降+百分点。</p>
                                <p>例：2015 年一季度，该省园区企业上缴税金占主营业务收入的比重比上年同期：</p>
                                <p>A.上升了 0.1 个百分点 &nbsp;&nbsp; B.上升了 3.1 个百分点</p>
                                <p>C.下降了 0.1 个百分点 &nbsp;&nbsp; D.下降了 3.1 个百分点</p>
                                <p>答：出现“占”字，是比重，给了 2015 年和同比，两期比重问题。直接用现期比重- 基期比重，比如 2015 年一季度占比是 5%，去年同期占比是 4%，则现在的占比比过去的占比上升了 5-4=1 个百分点。</p>
                                <p>2.计算公式：现期比- 基期比。</p>
                                <p>（1）A/B-A/B*[（1+b）/（1+a）]=A/B*[（a-b）/（1+a）]=A/B*[1/（1+a）]*（a-b）＜|a-b|。</p>
                                <p>（2）推导：把式子拆成三个部分，A/B 是一个部分，1/（1+a）是一个部分，（a-b）是一个部分。A/B 是现期比重，比重=部分（小数）/总体（大数），肯定小于 1。再看 1/（1+a），如果 a＞0，则 1/（1+a）＜1；如果 a＜0，则 1/（1+a）＞1；a 的取值不同，会有两种情况。我们做的是资料分析，根据我国的发展数据可知，比重 A/B 往往很小，最高达到 50%，所以 A/B＜1，如果 a＞0，A/B*[1/（1+a）]肯定＜1；在资料分析中，如果 a＜0，1/（1+a）也只会比 1 大一丢丢，综合起来，A/B*[1/（1+a）]还是比 1 小。</p>
                                <p>（3）记住结论：A/B*[1/（1+a）]永远＜1，再乘以（a-b），所以 A/B*[1/（1+a）]*（a-b）＜|a-b|。</p>
                                <p>3.解题步骤：</p>
                                <p>（1）判方向（a＞b，上升；a＜b，下降）。</p>
                                <p>（2）定大小：小于|a-b|，算出差值，选一个比差值小的即可。</p>
                                <p>4.注意：a 对应分子（部分量）的增长率；b 对应分母（总体量）的增长率。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】比重梳理：（出现“占”/利润率/增长贡献率）</p>
                                <p>1.现期比重→占→占前（A）/占后（B）。</p>
                                <p>2.基期比重→占、基期→A/B*[（1+b）/（1+a）]。</p>
                                <p>3.（1）两期比重→比重、升降→a＞b，比重升，a＜b，比重降；</p>
                                <p>（2）两期比重→比重、百分点→先判升降，再选小。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】比重小结：</p>
                                <p>1.现期比重：</p>
                                <p>（1）识别：问题时间与材料一致，占，比重。</p>
                                <p>（2）公式：比重=部分/总体；总体=部分/比重；部分=总体*比重。</p>
                                <p>（3）速算：截位直除法。</p>
                                <p>2.基期比重：</p>
                                <p>（1）识别：问题时间在材料之前，占，比重。</p>
                                <p>（2）公式：[A/（1+a）]÷[B/（1+b）]=A/B*[（1+b）/（1+a）]。</p>
                                <p>（3）速算：</p>
                                <p>&nbsp;&nbsp;- ①截位直除。</p>
                                <p>&nbsp;&nbsp;- ②先计算现期比重，再判断大小。</p>
                                <p>3.两期比重：</p>
                                <p>（1）识别：两个年份，一个比重。</p>
                                <p>（2）公式：A/B*[（a-b）/（1+a）]。</p>
                                <p>（3）升降判断：比较部分与总体增长率，部分大则升、小则降。</p>
                                <p>（4）速算：比重差的绝对值小于增长率之差的绝对值，即|A/B*[（a-b）/（1+a）]|＜|a-b|。</p>
                            </div>
                        </div>
                    </div>
                </div>
                <el-card class="summary" v-show="sectionOpen.s6">
                    <div slot="header" class="clearfix">
                        <span>比重</span>
                    </div>
                    <el-tree :data="summary.d7" :props="defaultProps" default-expand-all></el-tree>
                </el-card>
            </div>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s7')">第七节 平均数</h3>
                <div class="section-c" v-show="sectionOpen.s7">
                    <div class="border-radius">
                        <p>【知识点】平均数：现期平均数、基期平均数、两期平均数。</p>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、现期平均数</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】现期平均（和比重没有区别）：</p>
                                <p>1.题型识别：问题时间与材料一致+平均（均、每、单位，比如人均工资，每亩的产量）。要做好和比重的区分，“占”是比重问题；“均、每、单位”是平均数问题。</p>
                                <p>2.计算公式：平均数=总数/个数=A/B。</p>
                                <p>3.计算形式：后/前（永远用后面的量/前面的量，肯定不会错）。</p>
                                <p>（1）人均收入=收入/人数。</p>
                                <p>（2）每亩的产量=产量/亩数。</p>
                                <p>（3）单位面积产量=产量/面积。</p>
                                <p>4.速算技巧：截位直除。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】</p>
                                <p>1.客运平均运送距离=旅客周转量/客运量，国考和省考经常考，要记住这个公式。如果记不住，也可以通过单位解决，周转量的单位是亿人公里，客运量的单位是亿人，两者约分之后只剩公里。</p>
                                <p>2.对统计周转量的理解：假如一个人去西安，距离为 1200 公里，过去一趟是 1200 公里，回来一趟又是 1200 公里，一个人走了 2 次，相当于是 2 人次，所以运输了 1200*2 人次=2400 公里，周转量对应公里数。</p>
                            </div>
                            <div class="border-radius">
                                <p>【例3】（2015国考）2013年每个馆办文艺团体平均每月演出约多少场？</p>
                                <p>A.25 &nbsp;&nbsp; B.12  &nbsp;&nbsp; C.5  &nbsp;&nbsp; D.2</p>
                                <p>【解析】例 3.方法一：出现“平均数”，时间 2013 年为现期，现期平均数问题。每个馆演出场次=场次/馆=15.13/6022，注意题目还问了“每月”，前面求出来的是全年的值，因此所求=15.13 万/6022÷12=15.13 万/（6022*12）≈ 15.13/7.2 万，首位商 2，对应 D 项。</p>
                                <p>方法二：猜题思路。考虑以坑治坑，有的人会忘记除以 12，观察选项，A 项和 D 项存在 12 倍的关系，忘记除 12 会选 A 项，正确做法应该再除以 12，对应 D 项。【选 D】</p>
                                <p></p>
                                
                                <p>【注意】</p>
                                <p>1.题目出现几个“平均每”，就需要除几次。</p>
                                <p>2.方法二不保证 100%全对，在考场上没时间的时候可以用。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】</p>
                                <p>1.比如有三个人的考试成绩分别是 101、99、100，则三个人的平均分是 100。肯定不是按照三个数字加和再除以 3 去求，而是看 101 比 100 多了 1，99 比 100 少了 1，把多的补给少的。利用互补思维求解平均数问题，就是削峰填谷。</p>
                                <p>2.如果选项给了具体值，3234、3358、3446、3589 的时候，可以用尺子量；如果是给区间范围，建议大家按照削峰填谷的思路做。</p>
                                <p>3.基准线怎么确定？基准线不影响最终结果，但是基准线一定要居中，越居中，多的部分补齐少的部分就越好看；如果基准线定成 1000、2000，计算的时候就没有意义，因为不能减少计算量，定成居中的基准线，是为了尽量前后抵消。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、基期平均数</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】基期平均数：</p>
                                <p>1.题型识别：问题时间在材料之前+平均数问法（均、每、单位）。</p>
                                <p>2.计算公式：基期平均=A/B*[（1+b）/（1+a）]</p>
                                <p>3.速算技巧：截位直除、与现期比较。</p>
                                <p>4.例：2017 年全公司收入 A 个亿，同比增长率为 a，公司有 B 口人，同比增长率为 b，问 2016 年全公司人均收入为多少？</p>
                                <p>答：给 2017 年问 2016 年，平均数=后/前，2016 年人均收入=2016 年收入/2016 年人数=A/（1+a）÷[B/（1+b）]=A/（1+a）*[（1+b）/B]=A/B*[（1+b）/（1+a）]，与基期比重的公式相同。出现“占”字是比重问题，出现平均数问法就是平均数问题。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">三、两期平均数</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】两期平均数——升降：</p>
                                <p>1.题型识别：题干中涉及两个时间+平均数问法。比如问 2018 年人均收入比 2017 年人均收入是上升还是下降？</p>
                                <p>2.公式：现期平均- 基期平均=A/B-A/B*[（1+b）/（1+a）]=A/B*[（a-b）/（1+a）]。</p>
                                <p>例：公司年底发奖金，人均奖金=钱数/人数，如果今年钱数翻了好几倍，人数只增加了一两个，那么每个人分到的钱就会变多，即 a＞b，平均数上升。如果钱数只增长了一点点，而人数招了很多，僧多粥少，那么每个人分到的钱就会变少，即 a＜b，平均数下降。</p>
                                <p>3.升降判断：方法和两期比重相同。</p>
                                <p>（1）a＞b，平均数上升。</p>
                                <p>（2）a＜b，平均数下降。</p>
                                <p>（3）a=b，平均数不变。</p>
                                <p>（4）a：分子的增长率，b：分母的增长率。</p>
                                <p>4.以下问题现期均为 2019 年，请判定题型：</p>
                                <p>（1）2019 年人均收入是多少？</p>
                                <p>答：出现“人均”，时间为现期，现期平均数问题。</p>
                                <p>（2）2018 年粮食单位面积产量是多少？</p>
                                <p>答：给 2019 年问 2018 年，单位面积产量是平均数，基期平均数问题。</p>
                                <p>（3）2019 年我的收入占全家总收入的比重比上年上升还是下降？</p>
                                <p>答：两个时间+比重，两期比重问题。</p>
                                <p>（4）2019 年人均收入比上年上升还是下降？</p>
                                <p>答：人均收入是平均数，两个时间比较，两期平均数问题。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】两期平均——增长率计算：</p>
                                <p>1.识别：平均数+增长+%。</p>
                                <p>例：2018 年人均工资比 2017 年人均工资增长了百分之几？如果 2018 年人均工资为 5 元，2017 年人均工资为 4 元，则增长率=（5-4）/4=25%。</p>
                                <p>2.公式：r=（a-b）/（1+b）。a 是分子的增长率，b 是分母的增长率。</p>
                                <p>推导：现期平均数为 A/B，基期平均数为 A/B*[（1+b）/（1+a）]，r=[A/B-A/B*（1+b）/（1+a）]÷[A/B*（1+b）/（1+a）]=[1-（1+b）/（1+a）]÷[（1+b）/（1+a）]=[（1+a）-（1+b）]/（1+b）=（a-b）/（1+b）。</p>
                                <p>3.做题逻辑：</p>
                                <p>（1）确定分子、分母（谁÷谁）。</p>
                                <p>（2）代入公式：r=（a-b）/（1+b）。</p>
                                <p>4.以下问题现期均为 2019 年，请判定题型：</p>
                                <p>（1）2019 年我的收入占全家总收入的比重比上年上升了几个百分点？</p>
                                <p>答：关键词是“占”，比重问题，2019 年和上年相比，为两期比重问题。a＞b，上升，a＜b，下降；判定升降之后选最小。</p>
                                <p>（2）2019 年人均收入比上年增长了百分之几？</p>
                                <p>答：关键词是“均”，平均数问题，问 2019 年比上年增长+%，为平均数的增长率，公式：（a-b）/（1+b）。</p>
                            </div>
                        </div>
                    </div>
                    <div class="border-radius">
                        <p>【注意】平均数相关：</p>
                        <p>1.现期平均数：</p>
                        <p>（1）识别：问题时间与材料一致+平均（均、每、单位）。</p>
                        <p>（2）公式：平均数=总数/个数，后面/前面</p>
                        <p>（3）技巧：截位直除；削峰填谷。</p>
                        <p>2.基期平均数：</p>
                        <p>（1）识别：问题时间在材料之前+平均（均、每、单位）。</p>
                        <p>（2）公式：A/（1+a）÷[B/（1+b）]=A/B*[（1+b）/（1+a）]。</p>
                        <p>（3）速算：</p>
                        <p>&nbsp;&nbsp;- ①截位直除。</p>
                        <p>&nbsp;&nbsp;- ②先计算现期平均数，再判断大小。</p>
                        <p>3.两期平均数：</p>
                        <p>（1）识别：题干中涉及两个时间+平均（均、每、单位）。</p>
                        <p>（2）升降判断：看分子、分母增长率，分子大则升、小则降。</p>
                        <p>（3）平均数的增长率：</p>
                        <p>&nbsp;&nbsp;- ①先找出分子的增速 a 和分母的增速 b。</p>
                        <p>&nbsp;&nbsp;- ②代入公式：（a-b）/（1+b）。</p>
                    </div>
                </div>
                <el-card class="summary" v-show="sectionOpen.s7">
                    <div slot="header" class="clearfix">
                        <span>平均数</span>
                    </div>
                    <el-tree :data="summary.d8" :props="defaultProps" default-expand-all></el-tree>
                </el-card>
            </div>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s8')">第八节 倍数</h3>
                <div class="section-c" v-show="sectionOpen.s8">
                    <div class="border-radius">
                        <p>基本术语：</p>
                        <p>倍数用来表示两者的相对关系。</p>
                        <p>若 A 是 B 的 n 倍，则 n=r+1（r 指 A 与 B 相比的增长率）。</p>
                    </div>
                    <div class="border-radius">
                        <p>【知识点】倍数：</p>
                        <p>1.题型识别：时间+倍数。</p>
                        <p>2.现期倍数：A/B，与现期比重、现期平均数的公式相同。</p>
                        <p>例：2017 年，小明收入 10 个亿，马云收入 2 个亿，小明收入是马云的多少倍？</p>
                        <p>答：小学难度，A/B=10/2=5 倍。</p>
                        <p>3.基期倍数：A/B*[（1+b）/（1+a）]，与基期比重、基期平均数的公式相同。</p>
                        <p>例：2017 年，小明收入 A 个亿，同比增长率为 a，马云收入 B 个亿，同比增长率为 b，2016 年小明收入是马云的多少倍？</p>
                        <p>答：2016 年小明/2016 年马云=A/（1+a）÷[B/（1+b）]=A/（1+a）*[（1+b）/B]=A/B*[（1+b）/（1+a）]。</p>
                        <p>4.速算技巧：截位直除；先计算 A/B，再看（1+b）/（1+a）与 1 的关系。</p>
                        <p>5.易错点：</p>
                        <p>（1）A 是 B 的几倍：A/B，是“真”倍数，直接除。</p>
                        <p>（2）A 比 B 增长（多）几倍：（A-B）/B=A/B-1，是“假”倍数，本质上是增长率，除完要减 1。倍数=r+1，A/B-1=r。</p>
                        <p>（3）A 超过 B 的 n 倍：超过就是“＞”，A＞B*n→A/B＞n。</p>
                        <p>6.注意：倍数没有两期问题，只有现期倍数和基期倍数。</p>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、现期倍数</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【注意】选项差距大，可以把 0.83/1.22 看成 2/3，用 0.66 进行估算。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、基期倍数</h4>
                        <div class="modal-c"></div>
                    </div>
                    <div class="border-radius">
                        <p>【注意】倍数：</p>
                        <p>1.现期倍数：</p>
                        <p>（1）识别：问题时间与材料一致，A 是 B 的多少倍。</p>
                        <p>（2）公式：A/B。</p>
                        <p>（3）速算：截位直除法。</p>
                        <p>2.基期倍数：</p>
                        <p>（1）识别：问题时间在材料之前，A 是 B 的多少倍。</p>
                        <p>（2）公式：A/（1+a）÷[B/（1+b）]=A/B*[（1+b）/（1+a）]。</p>
                        <p>（3）速算：①截位直除；②先算现期倍数，再判断大小。</p>
                        <p>3.倍数与增长：</p>
                        <p>（1）A 是 B 的 n 倍：n=A/B。</p>
                        <p>（2）A 比 B 增长（多）r 倍：r=A/B-1。</p>
                    </div>
                    <div class="border-radius">
                        <p>【注意】比重、平均数、倍数问题考点辨析：</p>
                        <p>1.比重（关键词：占、比重）：</p>
                        <p>（1）现期：A/B。</p>
                        <p>（2）基期：A/B*[（1+b）/（1+a）]。</p>
                        <p>（3）升降判断：a＞b，比重上升；a＜b，比重下降；a=b，比重不变。</p>
                        <p>（4）定量计算：两期比重差=A/B*[（a-b）/（1+a）]，先判升降，再选最小。</p>
                        <p>2.平均数（关键词：均、每、单位）：</p>
                        <p>（1）现期：A/B，后/前。</p>
                        <p>（2）基期：A/B*[（1+b）/（1+a）]。</p>
                        <p>（3）升降判断：a＞b，平均数上升；a＜b，平均数下降；a=b，平均数不变。</p>
                        <p>（4）定量计算：平均数的增长率=（a-b）/（1+b）。</p>
                        <p>3.倍数（关键词：倍）：</p>
                        <p>（1）现期：A/B。</p>
                        <p>（2）基期：A/B*[（1+b）/（1+a）]。</p>
                        <p>4.注：a 代表分子增长率；b 代表分母增长率。</p>
                    </div>
                </div>
                <el-card class="summary" v-show="sectionOpen.s8">
                    <div slot="header" class="clearfix">
                        <span>倍数</span>
                    </div>
                    <el-tree :data="summary.d9" :props="defaultProps" default-expand-all></el-tree>
                </el-card>
            </div>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s9')">第九节 特殊增长率</h3>
                <div class="section-c" v-show="sectionOpen.s9">
                    <div class="border-radius">
                        <p>【注意】</p>
                        <p>1.比重：</p>
                        <p>（1）关键词：占。</p>
                        <p>（2）现期比重：比重=部分/总量，部分=总量*占比，总体=部分/占比。</p>
                        <p>（3）基期比重：</p>
                        <p>&nbsp;&nbsp;- ①公式：A/B*[（1+b）/（1+a）]。</p>
                        <p>&nbsp;&nbsp;- ②速算：先计算左边 A/B，再看右边和 1 的大小关系，如果分析不出来再对右边进行精算，一般都是可以分析出来的。</p>
                        <p>（4）两期比重比较：判升降，选最小。a＞b，比重上升；a＜b，比重下降。国考中的两期比重都是选最小值，所以可以大胆预测出题人就是这样设置选项的。如果担心选最小会出错，可以用两期比重公式计算，A/B*[（a-b）/（1+a）]，计算至少需要 2 分钟，还不一定算对，不如 1 秒钟蒙出正确答案，要注重性价比。</p>
                        <p>2.平均数：</p>
                        <p>（1）关键词：平均/每/单位。“单位”指的是单位面积产量。</p>
                        <p>（2）现期平均数=后/前，每人多少钱，钱/人数；平均每班多少人，总人数/班级数。分子是 A，分母是 B。</p>
                        <p>（3）削峰填谷：第一步，找基准，尽量居中，这样多的部分和少的部分才能尽可能互补；第二步，用多的去补少的，再求平均数。</p>
                        <p>（4）基期平均：</p>
                        <p>&nbsp;&nbsp;- ①公式：A/B*[（1+b）/（1+a）]。</p>
                        <p>&nbsp;&nbsp;- ②速算：先计算左边 A/B，再看右边和 1 的大小关系。</p>
                        <p>（5）两期平均比较：a＞b，平均数上升；a＜b，平均数下降。</p>
                        <p>（6）平均数的增长率：r=（a-b）/（1+b）。a 是 A 的增长率，b 是 B 的增长率。A 永远是分子，B 永远是分母，每个班多少人，后/前，全部人数/班级数，人数就是 A，班级数就是 B。</p>
                        <p>3.倍数：</p>
                        <p>（1）关键词：倍。</p>
                        <p>（2）出现倍数，关键看时间和问法：时间上分为现期倍数和基期倍数；问法：A 是 B 的几倍，A/B；A 比 B 多几倍，A/B-1。</p>
                    </div>
                    <div class="border-radius">
                        <p>【知识点】特殊增长率：可能国考 20 题资料分析中就出 2 题，但是一定会有所涉及。隔三差五会考查间隔增长率、混合增长率，但本身考查的频率不高。</p>
                        <p>1.间隔增长率。</p>
                        <p>2.年均增长率。</p>
                        <p>3.混合增长率。</p>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、间隔增长率</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】间隔增长率：之前学的增长率都是连续的状态，比如 2019 年比2018 年，这是同比增长率，2019 年 7 月比 2019 年 6 月增长，这是环比增长率。间隔增长率的时间一定是隔开的，已知：某企业 2018 年主营业务收入同比增长率为 `r_1`，2017 年同比增长率为 `r_2`。求：该企业 2018 年主营业务收入比 2016 年的增长率为多少？时间不连续，中间间隔一年，求增长率，就是间隔增长率。</p>
                                <p>1.公式推导：`r=r_1+r_2+r_1*r_2`。已知 2018 年同比增长率为 `r_1`，2017 年同比增长率为 `r_2`。求：2018 年比 2016 年的增长率。没有 2016 年的数据，2018 年是现期，2016 年是基期，求增长率可以用（2018 年-2016 年）/2016 年。假如 2016年的值用 2016 表示，2017 年同比增长率为 `r_2`，2017 年的值为`基期*（1+r）=2016*（1+r_2）`，2018 年同比增长率为 `r_1`，`2018=2017*（1+r_1）=2016*（1+r_1）*（1+r_2）`，所以（2018 年-2016 年）/2016 年=[2016*（1+`r_1`）*（1+`r_2`）-2016]/2016=`1+r_1+r_2+r_1*r2-1`=`r_1+r_2+r_1*r_2`。</p>
                                <p>2.`r_1`、`r_2`怎么找？`r_1`是现期时间的增长率，`r_2`是间隔时间的增长率。</p>
                                <p>（1）例：2018 年比 2016 年增长了百分之几？`r_1`：2018 年的同比增长率。`r_2`：2017 年的同比增长率。</p>
                                <p>（2）练习：</p>
                                <p>&nbsp;&nbsp;- ①2017 年比 2015 年增长了百分之几？2017 年和 2015 年中间间隔 2016 年，`r_1`：2017 年的同比增长率。`r_2`：2016 年的同比增长率。</p>
                                <p>&nbsp;&nbsp;- ②2014 年比 2012 年增长了百分之几？2014 年和 2012 年中间间隔 2013 年，`r_1`：2014 年的同比增长率。`r_2`：2013 年的同比增长率。但是没有必要区分 `r_1`和`r_2`，加法和乘法都有交换律，`r=r_1+r_2+r_1*r_2=r_2+r_1+r_2*r_1`。</p>
                                <p>3.公式咋算？</p>
                                <p>（1）不计算：结合选项排除。例：15%+18%+15%*18%≈？</p>
                                <p>A.35.7% &nbsp;&nbsp; B.30.9% &nbsp;&nbsp; C.28.9% &nbsp;&nbsp; D.41.6% </p>
                                <p>答：乘法部分很难算，估算在前，如果估算不了，再想其他办法，15%+18%=33%，还要加两个数的乘积，结果一定大于 33%，排除 B、C 项。15%*18%只有一点点，选择 A 项。</p>
                                <p>（2）可估算：`r_1`、`r_2`的绝对值均小于 10%，`r_1`*`r_2`可以忽略。10%*10%=1%，如果 `r_1`、`r_2`的绝对值均小于 10%，`r_1`*`r_2`就 1%都不到了，可以忽略不计。</p>
                                <p>&nbsp;&nbsp;- ①：5%+8%+5%*8%≈？5%+8%=13%，5%*8%很容易计算，但如果是 5.13%*8.28%，就很难计算了。5%、8%均小于 10%，5%*8%可以直接忽略，只需要计算加法部分。</p>
                                <p>&nbsp;&nbsp;- ②：5%+36%+5%*36%≈？5%＜10%，但是 36%＞10%，只有当 `r_1`、`r_2` 的绝对值均小于 10%才可以忽略 `r_1`*`r_2`，因此 5%*36%不能忽略，5%*36%=1/20*36%=1.8%，原式=41%+1.8%=42.8%。或者 36%≈33%≈1/3，5%*1/3=1<sup>+</sup>%。</p>
                                <p>&nbsp;&nbsp;- ③：17.9%+20.2%+17.9%*20.2%≈？17.9%+20.2%=38.1%，17.9%、20.2%均大于 10%，不能忽略 17.9%*20.2%，20.2%≈20%=1/5，17.9%*1/5，或者直接看成18%*20%。注意：a%*b%=（a*b/100）%。17.9%*20.2%≈18%*20%=（18*20/100）%=3.6%。</p>
                                <p>（3）不得不算：结合特殊分数。</p>
                                <p>&nbsp;&nbsp;- ①28%+25%+28%*25%=？28%+25%+28%*25%=53%+28%*1/4=60%。</p>
                                <p>&nbsp;&nbsp;- ② -18%+5%+ （ -18% ） *5%= ？ -18%+5%+ （ -18% ） *5%=-13%+ （ -18% ）*1/20=-13%-1<sub>-</sub>%=-14<sub>-</sub>%。</p>
                                <p>&nbsp;&nbsp;- ③-18%+（-5%）+（-18%）*（-5%）=？-18%+（-5%）+（-18%）*（-5%）≈ -23%+1%=-22%。</p>
                                <p>4.间隔增长率总结：</p>
                                <p>（1）识别：中间隔一年，求增长量。比如 2019 年比 2017 年，2016 年比 2014年。只有中间间隔一年的可以用间隔增长率公式。如果问 2018 年相比 2008 年的增长率，用不了间隔增长率，就是一个普通的增长率，会给 2018 年的现期值和 2008 年的基期值，用（2018 年-2008 年）/2008 年。</p>
                                <p>（2）公式：`r=r_1+r_2+r_1*r_2`。</p>
                                <p>（3）技巧：</p>
                                <p>&nbsp;&nbsp;- ①`r_1`、`r_2`绝对值均小于 10%时，`r_1`*`r_2`可忽略。</p>
                                <p>&nbsp;&nbsp;- ②结合选项或百化分。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】间隔倍数：</p>
                                <p>1.识别：中间隔一年，求倍数。</p>
                                <p>2.公式：间隔倍数=间隔增长率+1</p>
                                <p>3.做题步骤：</p>
                                <p>（1）先算间隔增长率 `r=r_1+r_2+r_1*r_2`。</p>
                                <p>（2）再加 1。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】间隔基期量：</p>
                                <p>1.识别：间隔一年，求基期量。给2018年问2016年的量，间隔基期。</p>
                                <p>2.公式：间隔基期量=现期量/（1+间隔增长率）。</p>
                                <p>3.做题步骤：</p>
                                <p>（1）先求间隔增长率`r=r_1+r_2+r_1*r_2`。</p>
                                <p>（2）计算：现期量/（1+间隔r）。</p>
                            </div>
                            <div class="border-radius">
                                <p>【知识点】间隔增长量：</p>
                                <p>1.识别：中间隔一年，求增长量。</p>
                                <p>2.公式：算出间隔增长率，再用百化分计算。</p>
                                <p>3.做题步骤：</p>
                                <p>（1）先算间隔增长率`r=r_1+r_2+r_1*r_2`</p>
                                <p>（2）再百化分。</p>
                                <p>（3）间隔增长率＞0，增长量=现期/（n+1）；间隔增长率＜0，减少量=现 期/（n-1）。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】间隔+增长率、倍数、基期量、增长量小结：例1～5的共同点：都是间隔年份，都算了间隔增长率。只不过有些题只需要算间隔增长率，有些题算的是间隔倍数、间隔基期量、间隔增长量。以后看到有间隔年份的题，先把年均增长率算出来。</p>
                                <p>1.题型识别：中间隔一年，求增长率/倍数/基期量/增长量。</p>
                                <p>2.公式：`r_间=r_1+r_2+r_1*r_2`；间隔倍数=`r_间`+1；间隔基期量=现期量/（1+`r_间`）；间隔增长率百化分，间隔增长量=现期/（n+1）。</p>
                                <p>3.速算技巧：</p>
                                <p>（1）结合选项排除。</p>
                                <p>（2）`r_1`、`r_2`的绝对值均小于10%，`r_1`*`r_2`可以忽略。</p>
                                <p>（3）特殊分数。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、年均增长率</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】年均增长率：国考中不会出现年均增长率计算，深圳、浙江、江西曾经考过。</p>
                                <p>1.公式：`（1+r）^n`=现期值/基期值（n 为现期和基期的年份差）。</p>
                                <p>2.识别：年均增长（增速）最快/排序；年均增长率为。</p>
                                <p>示例：某企业 2011 年的收入为 100 亿元，2014 年的收入为 200 亿元，则该企业 2011 年至 2014 年收入的年均增长率为多少？</p>
                                <p>答：年均增长率和年均增长量的意思相似，都是每年的平均值。区别是：年均增长量=总的增长量/年份差=（200-100）/3≈33.3；但年均增长率有所不同，不是用总的增长率除以年份差，指的是每年增长率都一样，2011 年为基期，收入为 100 亿元，2012 年增长 r，所以 2012 年=100*（1+r），到 2013 年又增长 r，2013 年=100*（1+r）*（1+r）=100*（1+r）²，2014 年=100*（1+r）*（1+r）*（1+r）=100*（1+r）³，所以基期*`(1+r)^³`=现期，其中 n 指的是年份差，通用公式就是`（1+r）^n`=现期/基期。</p>
                                <p>3.年均增长类问题年份差的选择：</p>
                                <p>（1）一般情况（除江苏外）：2011 年～2015 年：年份差为 4。基期：2011年；现期：2015 年。</p>
                                <p>（2）五年规划（全国都一样）：十二五期间：年份差为 5（基期往前推一年）。基期：2010 年；现期：2015 年。</p>
                                <p>（3）江苏省考（特殊）：2011 年～2015 年：年份差为 5（基期往前推一年）。基期：2010 年；现期：2015 年。</p>
                                <p>4.比较：国考只考比较，不考计算。</p>
                                <p>（1）识别：年均增长最快、年均增速排序。</p>
                                <p>（2）公式：`（1+r）^n`=现期值/基期值（n 为现期和基期的年份差）。</p>
                                <p>（3）技巧：</p>
                                <p>&nbsp;&nbsp;- ①比较：n 相同，比较 r 的大小取决于“现期/基期”，直接比较“现期/基期”。“现期/基期”越大，r 越大；“现期/基期”越小，r 越小。</p>
                                <p>&nbsp;&nbsp;- ②计算：居中代入，如果考试中居中代入都无法得到答案，建议放弃。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】</p>
                                <p>1.选择比较好算的中间量，最多代入两次。</p>
                                <p>2.曾经江西省考有一次考试选项设置类似为27%、28%、29%、30%，没有办法代入，遇到这种题直接放弃。</p>
                            </div>
                        </div>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">三、混合增长率</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】混合增长率：</p>
                                <p>1.例：已知2019年房地产利润为100亿，2018年房地产利润为80亿，求2019年房地产利润比去年增加（ ）%？</p>
                                <p>答：r=（现期- 基期）/基期=（100-80）/80。但如果材料中没有直接给出房地产利润，只给出房产和地产的数据，不可能通过公式一步解决，需要二者混合起来求增长率。</p>
                                <p>2.题型识别：部分与总体之间的增长率关系。常见概念：</p>
                                <p>（1）房产+地产=房地产。</p>
                                <p>（2）进口+出口=进出口。</p>
                                <p>（3）城镇+农村=全国。</p>
                                <p>（4）上半年+下半年=全年。</p>
                                <p>（5）硕士+博士=研究生。山东省公务员考试曾经考过研究生的常识，要作为重点，硕士是硕士研究生，博士是博士研究生，合起来是研究生的总体。</p>
                                <p>（6）1～2 月+3 月=一季度。</p>
                                <p>（7）一季度+二季度=上半年。</p>
                                <p>3.判断口诀：</p>
                                <p>（1）混合后居中（整体增长率介于部分增长率之间）。可以理解为两杯盐水混合，一杯浓度是10%，另一杯浓度是20%，混合后浓度一定介于10%～20%之间。如果多个量混合，浓度为5%、10%、28%的三杯盐水混合，混合后浓度介于5%～28%（最小值～最大值）之间。</p>
                                <p>（2）偏向基期较大的（基期指的基期量，做题中一般用现期量近似代替，答案有误差，但基本可以忽略不计）。类似于拔河的思路，哪边人多哪边就有优势：浓度为10%的盐水一杯和浓度为20%的盐水一杯混合，混合后一定居中，浓度为15%。如果20%的盐水加200杯，10%的盐水加1杯，混合后结果一定接近20%。如果10%的盐水有1000杯，20%的盐水有1杯，混合后一定接近10%。如果将一颗糖丢进游泳池中，游泳池不会变甜，因为相比之下游泳池的水特别多；如果将一滴黑色墨水滴到大海中，大海也不会发生变化，因为一滴墨水对于大海来说微不足道，起不到改变效果。</p>
                                <p>4.例：某地区2016年上半年GDP为800亿元，同比增速为8%，2016年下半年GDP为1200亿元，同比增速为12%。</p>
                                <p>问：该地区2016年全年的GDP同比增速约为？</p>
                                <p>A.7.2% &nbsp;&nbsp; B.8.7% &nbsp;&nbsp; C.10.4% &nbsp;&nbsp; D.13.1%</p>
                                <p>答：问题时间2016年全年，材料中给出的是上半年和下半年。求GDP增速，材料中没有2016年全年的现期值、基期值和增长率，无法用公式直接求解。根据上半年+下半年=全年，是混合的概念，求增长率，为混合增长率问题。上半年增速为8%，下半年增速为12%，混合后一定介于8%～12%之间，排除A、D项。然后看谁的量大，少数服从多数，8%对应800亿，12%对应1200亿，如果量相同，混合后居中，中间值为10%，但实际是800＜1200，所以结果更偏向12%（量大的一边），结果介于10%～12%之间，对应C项。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】</p>
                                <p>1.例如：a收入100亿，增长10%，b收入1元，增长100%，在100亿面前，1元微乎其微，可以省略。</p>
                                <p>2.三杯盐水混合，若想不通，则先两两混合，混合后再和第三杯混合。</p>
                                <p>3.用现期量代替基期量，因为基期量的计算麻烦，同时现期量和基期量比例关系相近，因此可以代替。</p>
                            </div>
                            <div class="border-radius">
                                <p>【注意】线段法：</p>
                                <p>1.混合问题：混合增长率，溶液，平均数，折扣，利润率问题等等。</p>
                                <p>2.方法：</p>
                                <p>（1）混合之前写两边。</p>
                                <p>（2）混合之后写中间。</p>
                                <p>（3）距离与量成反比。量指的是分母，如：增长率=增长量/基期量，浓度=溶质/溶液，平均数=总数/个数。</p>
                                <p>3.例1：100g浓度10%盐水与200g浓度25%盐水混合成盐水的浓度？</p>
                                <p>答：先画一条线段，混合之前写两边，左边为10%，右边为25%，混合之后写中间，混合的浓度为？，距离与量成反比，标好数字后线段变成数轴，10%到25%的长度为15，量永远为分母，浓度=溶质/溶液，10%对应100g，25%对应200g，量之比为1：2，则距离之比为2：1，左边对应2份，右边对应1份，线段平均分成3份，1份对应5%，则混合后的浓度=25%-5%=20%。</p>
                                <p>例2：男生100人，增长率为10%，女生200人，增长率为40%，问总人数的增长率。</p>
                                <p>答：线段法是解决两个量的关系，不可能出现好几段的情况。画一条线段，把两个量写在线段两边，混合之前写两边，男生和女生一边写一个，男生增长率为10%，女生增长率为40%，混合之后写中间，混合之后为总人数，在中间，为所求项。距离与量成反比，整个线段的长度为30%，男生100人，女生200人，量之比为1：2，则距离之比为2：1，则3份对应30%，1份对应10%，左边为2份对应20%，右边为1份对应10%，则混合后为10%+20%=30%。</p>
                            </div>
                        </div>
                    </div>
                    <div class="border-radius">
                        <p>【注意】特殊增长率：</p>
                        <p>1.间隔增长率：</p>
                        <p>（1）题型识别：中间隔一年求增长率。</p>
                        <p>（2）公式：`r=r_1+r_2+r_1*r_2`。</p>
                        <p>（3）速算技巧：</p>
                        <p>&nbsp;&nbsp;- ①`r_1`、`r_2`绝对值均小于 10%，结合选项 `r_1`*`r_2`可忽略。</p>
                        <p>&nbsp;&nbsp;- ②百化分。</p>
                        <p>2.年均增长率：</p>
                        <p>（1）题型识别：年均增长最快、年均增长排序。</p>
                        <p>（2）公式：`（1+r）^n`=现期/基期。</p>
                        <p>（3）比较方法：比较“现期/基期”（n 相同）。</p>
                        <p>3.混合增长率</p>
                        <p>（1）题型识别：部分增速与整体增速之间的关系。</p>
                        <p>（2）口诀：居中但不中；偏向基期较大的。</p>
                    </div>
                </div>
                <el-card class="summary" v-show="sectionOpen.s9">
                    <div slot="header" class="clearfix">
                        <span>特殊增长率</span>
                    </div>
                    <el-tree :data="summary.d10" :props="defaultProps" default-expand-all></el-tree>
                </el-card>
            </div>
            <div class="section-wrap">
                <h3 class="text-c section-t" @click="sectionOpenClose('s10')">第十节 其他</h3>
                <div class="section-c" v-show="sectionOpen.s10">
                    <div class="modal-wrap">
                        <h4 class="modal-t">一、简单计算</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【知识点】其他：</p>
                                <p>1.直接找数。</p>
                                <p>2.简单加减。</p>
                                <p>3.排序问题。</p>
                            </div>
                            <dl class="knowledge">
                                <dt>（一）直接找数</dt>
                                <dd>【注意】简单的题目注意时间坑和单位坑。</dd>
                            </dl>
                            <dl class="knowledge">
                                <dt>（二）简单加减</dt>
                            </dl>
                            <dl class="knowledge">
                                <dt>（三）排序问题</dt>
                                <dd>【知识点】排序问题四要素：</dd>
                                <dd>1.时间：现期还是基期？</dd>
                                <dd>2.主体：主体要看清。</dd>
                                <dd>3.单位：单位要一致。亿、万、美元、人民币。</dd>
                                <dd>4.顺序：从大到小？从小到大？</dd>
                            </dl>
                        </div>
                        <div class="border-radius">
                            <p>【注意】简单计算：</p>
                            <p>1.直接找数：注意范围等表述陷阱。</p>
                            <p>2.简单加减：</p>
                            <p>（1）选项与材料精度相同：尾数法。</p>
                            <p>（2）选项与材料精度不同：估算。</p>
                            <p>3.排序题：时间、单位、主体、顺序。</p>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>简单计算</span>
                            </div>
                            <el-tree :data="summary.d11" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>
                    </div>
                    <div class="modal-wrap">
                        <h4 class="modal-t">二、综合分析</h4>
                        <div class="modal-c">
                            <div class="border-radius">
                                <p>【注意】</p>
                                <p>1.资料分析的做题时间应在30分钟内，若复习的不到位，做题时间需要35分钟以上，综合分析可以放弃，做题的时候注重16道小题，正确率达到80%。</p>
                                <p>2.综合分析的问题一般是以下说法正确的或者错误的，最多看3个选项就能出答案。有的时候还会出现以下说法对的/错的有几个，每个都要看，一旦看错1个，则满盘皆输，这样的题目不建议做，所有的题目做完之后再做这样的题目。</p>
                                <p>3.按照大数据的结果，C、D项的正确率在50%～60%之间，A、B项的正确率在40%～50%之间，则先看C、D项，再看A、B项。做题的时候遇难则跳。</p>
                            </div>
                            <dl class="knowledge">
                                <dt>（一）直接找数</dt>
                            </dl>
                            <dl class="knowledge">
                                <dt>（二）简单加减</dt>
                            </dl>
                            <dl class="knowledge">
                                <dt>（三）排序问题</dt>
                            </dl>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>简单计算</span>
                            </div>
                            <el-tree :data="summary.d11" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        data(){
            return {
                mymsg: '这是第二个页面哦~',
                summary: {
                    d1: [],
                    d2: [],
                    d3: [],
                    d4: [],
                    d5: [],
                    d6: [],
                    d7: [],
                    d8: [],
                    d9: [],
                    d10: [],
                    d11: [],
                    d12: [],
                    d13: [],
                    d14: [],
                },
                defaultProps: {
                    children: 'children',
                    label: 'label'
                },
                sectionOpen:{},
            };
        },
        created(){
            this.initData();
            
        },
        mounted(){
            let self = this;
            if(self.commonsVariable.isMathjaxConfig){//判断是否初始配置，若无则配置。
                self.commonsVariable.initMathjaxConfig();
            }
            self.commonsVariable.MathQueue('pdf03');
            this.drawLine('echart01');
        },
        methods: {
            sectionOpenClose(sectionNum){
                let self = this;
                self.$set(self.sectionOpen, sectionNum, !self.sectionOpen[sectionNum]);
            },
            // 初始化数据
            initData(){
                let self = this;
                self.getSummary1();
                self.getSummary2();
                self.getSummary3();
                self.getSummary4();
                self.getSummary5();
                self.getSummary6();
                self.getSummary7();
                self.getSummary8();
                self.getSummary9();
                self.getSummary10();
                self.getSummary11();
                self.getSummary12();
                self.getSummary13();
            },
            // 总结1内容(截位直除)
            getSummary1(){
                let self = this;
                let data = [{
                    label: '截谁',
                    children: [
                        {label: '一步除法：建议只截分母'},
                        {label: '多步计算：建议上下都截'},
                    ]
                },{
                    label: '截几位',
                    children: [
                        {
                            label: '选项差距大，截两位',
                            children: [
                                {label: '选项首位不同'},
                                {label: '选项首位相同，次位差大于首位'},
                            ],
                        },
                        {label: '选项差距小，截三位：选项首位相同且次位差小于等于首位'},
                    ]
                }];
                self.$set(self.summary, 'd1', data);
            },
            // 总结2内容(分数比较)
            getSummary2(){
                let self = this;
                let data = [{
                    label: '一大一小直接看',
                    children: [
                        {label: '根据分子比大小'},
                        {label: '分子大的分数大，分子小的分数小'},
                    ]
                },{
                    label: '同大同小',
                    children: [
                        {label: '竖着直接除'},
                        {label: '横着看速度'},
                        {label: '横竖哪个好看看哪个'},
                    ]
                }];
                self.$set(self.summary, 'd2', data);
            },
            // 总结3内容(材料阅读)
            getSummary3(){
                let self = this;
                let data = [{
                    label: '文字材料',
                    children: [
                        {label: '标记段落主题词，与题干进行匹配'},
                        {label: '注意相近词、时间、单位等'},
                    ]
                },{
                    label: '表格材料',
                    children: [
                        {label: '横纵标目、标题、单位、备注'},
                    ]
                },{
                    label: '图形材料',
                    children: [
                        {label: '标题、单位、图例'},
                    ]
                },{
                    label: '结合材料',
                    children: [
                        {label: '不同类型材料之间的关系、材料结构'},
                    ]
                }];
                self.$set(self.summary, 'd3', data);
            },
            // 总结4内容(基期与现期)
            getSummary4(){
                let self = this;
                let data = [{
                    label: '基期量',
                    children: [
                        {label: '识别：求前面某个时期的量'},
                        {label: '公式：基期量=现期量-增长量； 基期量=现期量÷(1+r)'},
                        {label: '速算：r大截位直除，r小化除为乘'},
                        {label: '基期和差：先用现期量和正负排除再计算'},
                    ]
                },{
                    label: '现期量',
                    children: [
                        {label: '识别：求后面某个时期的量'},
                        {label: '公式：现期量=基期量+增长量； 现期量=基期量×(1+r)'},
                        {label: '速算：截位计算，特殊数字'},
                    ]
                }];
                self.$set(self.summary, 'd4', data);
            },
            // 总结5内容(一般增长率)
            getSummary5(){
                let self = this;
                let data = [{
                    label: '计算',
                    children: [
                        {label: '识别：增长/下降+%，乘，倍；增长最快/慢'},
                        {
                            label: '方法：',
                            children: [
                                {label: '给百分点，直接加减'},
                                {label: '无百分点，r=增长量÷基期量'},
                            ],
                        },
                        {label: '速算：截位直除'},
                    ]
                },{
                    label: '比较',
                    children: [
                        {label: '识别：增长最快/慢；增长率最高/低'},
                        {
                            label: '方法：',
                            children: [
                                {label: '现期量÷基期量≥2，比较“现期量÷基期量”'},
                                {label: '现期量÷基期量＜2，比较“增长量÷基期量”'},
                            ],
                        },
                        {label: '速算：分数比较法'},
                    ]
                }];
                self.$set(self.summary, 'd5', data);
            },
            // 总结6内容(并列关系)
            getSummary6(){
                let self = this;
                let data = [{
                    label: '计算',
                    children: [
                        {label: '识别：增长+单位（人/元/吨）'},
                        {
                            label: '公式',
                            children: [
                                {label: '增长量=现期量-基期量=基期量×r=`((现期量)/(1+r))×r`'},
                                {label: '年均增长量=(现期量-基期量)÷年份差'},
                            ],
                        },
                        {
                            label: '速算',
                            children: [
                                {label: '百分数化分数：近似转化、区中转化、倍数转化'},
                                {label: '若|r|≈`1/N`，增长量≈`(现期量)/(N+1)`；下降量≈`(现期量)/(N-1)`'},
                            ],
                        },
                        {
                            label: '比较',
                            children: [
                                {label: '识别：增长最多/少'},
                                {
                                    label: '速算',
                                    children: [
                                        {label: '给出每年数据：直接两两相减，柱状图还可用直尺标注'},
                                        {label: '给出现期量和r：两者都大则增量必然大，否则百分化计算'},
                                    ]
                                },
                            ],
                        },
                    ]
                }];
                self.$set(self.summary, 'd6', data);
            },
            // 总结7内容(比重)
            getSummary7(){
                let self = this;
                let data = [{
                    label: '现期比重',
                    children: [
                        {label: '识别：问题时间和材料一致，占，比重'},
                        {label: '公式：比重=`(部分)/(总体)`；总体=`(部分)/(比重)`；部分=总体×比重'},
                        {label: '速算：截位直除'},
                    ]
                },{
                    label: '基期比重',
                    children: [
                        {label: '识别：问题时间在材料之前，占，比重'},
                        {label: '公式：`A/(1+a)÷B/(1+b)=A/B×(1+b)/(1+a)`'},
                        {label: '速算：（1）截位直除；（2）先计算现期比重，再判断大小'},
                    ]
                }, {
                    label: '两期比重',
                    children: [
                        {label: '识别：两个年份，一个比重'},
                        {label: '公式：`A/B×(a-b)/(1+a)`'},
                        {label: '升降判断：比较部分与总体增长率，部分大则升、小则降'},
                        {label: '速算：比重差的绝对值小于增长率之差的绝对值，即`|A/B×(a-b)/(1+a)|＜|a-b|`'},
                    ]
                }];
                self.$set(self.summary, 'd7', data);
            },
            // 总结8内容(平均数)
            getSummary8(){
                let self = this;
                let data = [{
                    label: '现期平均数',
                    children: [
                        {label: '识别：问题时间与材料一致+平均（均/每/单位）'},
                        {label: '公式：平均数=总数÷个数  后面÷前面'},
                        {label: '技巧：（1）截位直除；（2）削峰填谷'},
                    ]
                },{
                    label: '基期平均数',
                    children: [
                        {label: '识别：问题时间在材料之前+平均（均/每/单位）'},
                        {label: '公式：`A/(1+a)÷B/(1+b)=A/B×(1+b)/(1+a)`'},
                        {label: '速算：（1）截位直除；（2）先计算现期平均数，再判断大小'},
                    ]
                },{
                    label: '两期平均数',
                    children: [
                        {label: '识别：问题中涉及两个时间+平均（均/每/单位）'},
                        {label: '升降判断：看分子、分母增长率，分子大则升、小则降'},
                        {
                            label: '平均数的增长率',
                            children: [
                                {label: '（1）先找出分子的增速a和分母的增速b'},
                                {label: '（2）代入公式：`(a-b)/(1+b)`'},
                            ],
                        },
                    ]
                }];
                self.$set(self.summary, 'd8', data);
            },
            // 总结9内容(倍数)
            getSummary9(){
                let self = this;
                let data = [{
                    label: '现期倍数',
                    children: [
                        {label: '识别：问题时间与材料一致，A是B的多少倍'},
                        {label: '公式：A÷B'},
                        {label: '速算：截位直除'},
                    ]
                },{
                    label: '基期倍数',
                    children: [
                        {label: '识别：问题时间在材料之前，A是B的所少倍'},
                        {label: '公式：`A/(1+a)÷B/(1+b)=A/B×(1+b)/(1+a)`'},
                        {label: '速算：（1）截位直除；（2）先算现期倍数，再判断大小'},
                    ]
                },{
                    label: '倍数与增长',
                    children: [
                        {label: 'A是B的n倍：n=A÷B'},
                        {label: 'A比B增长（多）r倍：r=A÷B-1'},
                    ]
                }];
                self.$set(self.summary, 'd9', data);
            },
            // 总结10内容(特殊增长率)
            getSummary10(){
                let self = this;
                let data = [{
                    label: '间隔增长率',
                    children: [
                        {label: '识别：中间隔一年求增长率'},
                        {label: '公式：`r_(间隔)=r_1+r_2+r_1×r_2`'},
                        {
                            label: '速算：',
                            children: [
                                {label: '（1）`r_1`、`r_2`绝对值均小于10%，结合选项`r_1×r_2`可忽略'},
                                {label: '（2）百分化'},
                            ]
                        },
                    ]
                },{
                    label: '年均增长率',
                    children: [
                        {label: '识别：年均增长最快、年均增速排序'},
                        {label: '公式：`(1+r)^n=现期量÷基期量`'},
                        {label: '比较方法：比较“现期量÷基期量”（n相同）'},
                    ]
                },{
                    label: '混合增长率',
                    children: [
                        {label: '识别：部分增速与总体增速之间的关系'},
                        {label: '口诀：居中但不中，偏向基期较大的'},
                    ]
                }];
                self.$set(self.summary, 'd10', data);
            },
            // 总结11内容(简单计算)
            getSummary11(){
                let self = this;
                let data = [{
                    label: '直接找数',
                    children: [
                        {label: '注意范围等表述陷阱'},
                    ]
                },{
                    label: '简单加减',
                    children: [
                        {label: '选项与材料精度相同：尾数法'},
                        {label: '选项与材料精度不同：估算'},
                    ]
                }, {
                    label: '排序题',
                    children: [
                        {label: '时间、单位、主体、顺序'},
                    ]
                }];
                self.$set(self.summary, 'd11', data);
            },
            // 总结12内容(词的辨析)
            getSummary12(){
                let self = this;
                let data = [{
                    label: '词义侧重：辨析方法',
                    children: [
                        {label: '第一种：拆字组词：用不一样的字单独组词'},
                        {label: '第二种：整词搭配：用整个词进行组词搭配'},
                    ]
                },{
                    label: '固定搭配',
                    children: [
                        {
                            label: '搭配一个词：瞻前顾后找准搭配对象',
                        },
                        {
                            label: '搭配多个词',
                            children: [
                                {label: '横线所填词语搭配由“和”“及”“与”引导的并列结构'},
                                {label: '需与并列结构搭配恰当'},
                            ],
                        },
                    ]
                }, {
                    label: '程度轻重',
                    children: [
                        {
                            label: '区分词的程度轻重',
                            children: [
                                {label: '程度轻：大相径庭：相差很大，相差很多'},
                                {label: '程度重：截然不同：完全相反，完全不同'},
                            ],
                        },
                        {
                            label: '理论要点：所填词语的程度轻重与文段意思的轻重保持一致',
                        },
                    ]
                }, {
                    label: '感情色彩',
                    children: [
                        {
                            label: '区分词的感情色彩',
                            children: [
                                {label: '褒义：成果'},
                                {label: '贬义：后果'},
                                {label: '中性：结果'},
                            ],
                        },
                        {label: '理论要点：所填词语的感情色彩与文段的感情色彩保持一致'},
                    ]
                }];
                self.$set(self.summary, 'd12', data);
            },
            // 总结13内容(语境分析)
            getSummary13(){
                let self = this;
                let data = [{
                    label: '关联关系',
                    children: [{
                        label: '转折',
                        children: [
                            {label: '标志词：但是、然而、却等'},
                            {label: '理论要点：前后语义相反'},
                        ],
                    },{
                        label: '递进',
                        children: [
                            {label: '标志词：而且、甚至、更等'},
                            {label: '理论要点：语义程度前轻后重'},
                        ],
                    },{
                        label: '并列',
                        children: [
                            {
                                label: '标志词：而且、甚至、更等',
                                children: [
                                    {label: '同义并列：顿号（、）、逗号（，）'},
                                    {label: '反义并列：不是……而是……、是……不是……、相反、反之等'},
                                ]
                            },
                            {label: '理论要点：同义并列连接前后语义相近；反义并列连接前后语义相反'},
                            {label: '提示：相同句式也可表示并列'},
                        ],
                    }]
                },{
                    label: '对应关系',
                    children: [{
                        label: '解释类对应',
                        children: [
                            {label: '题干特点：分句， ，分句'},
                            {label: '标志词：即、就是、可以说、可谓、无异于、比如、例如等'},
                            {label: '标点：冒号（：）、破折号（——）'},
                        ],
                    },{
                        label: '重点词句对应',
                        children: [
                            {label: '重点词：指代词、主题词、形象表达'},
                            {label: '重点句：完整语句'},
                        ],
                    },{
                        label: '提示',
                        children: [
                            {label: '找准对应关系，要基于对整个文段意思的理解与把握'},
                        ],
                    }]
                }];
                self.$set(self.summary, 'd13', data);
            },
            // 画图
            drawLine(elId){
                // 基于准备好的dom，初始化echarts实例
                let myChart = this.$echarts.init(document.getElementById(elId))
                // 绘制图表
                myChart.setOption({
                    title: { text: '在Vue中使用echarts' },
                    tooltip: {},
                    xAxis: {
                        data: ["衬衫","羊毛衫","雪纺衫","裤子","高跟鞋","袜子"]
                    },
                    yAxis: {},
                    series: [{
                        name: '销量',
                        type: 'bar',
                        data: [5, 20, 36, 10, 10, 20]
                    }]
                });
            },
        },
    };
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="less" scoped>
    .pdf-wrap{
    }
</style>
<style lang="less" rel="stylesheet/less">
    @import "./../../style.less";
</style>