<template>
    <div class="pdf-wrap" id="pdf05">
        <!-- 公式参考： 
            https://blog.csdn.net/qq_42454244/article/details/104612666?utm_medium=distribute.pc_relevant.none-task-blog-baidulandingword-3&spm=1001.2101.3001.4242 
            https://www.jianshu.com/p/a0aa94ef8ab2
        -->
        <div class="pdf-cover">
            <h1 class="text-c pdf-t"><span>方法精讲 - 数量关系</span></h1>
        </div>
        
        <div class="chapter-wrap">
            <h2 class="text-c chapter-t" @click="sectionOpenClose('c1')"><span>第一章 | 数学运算</span></h2>
            <div class="chapter-c" v-show="sectionOpen.c1">
                <div class="section-wrap">
                    <h3 class="text-c section-t" @click="sectionOpenClose('s1')">第一节  代入排除法</h3>
                    <div class="section-c" v-show="sectionOpen.s1">
                        <div class="border-radius">
                            <p>【知识点】代入排除：将选项代入题干进行验证，排除错误答案，中学数学大部分分数在填空题和简答题上，选择题仅占 30%，但是公务员考试都是选 择题。</p>
                            <p>1.适用：特定题型。</p>
                            <p>（1）年龄问题：已知年龄大小，如已知张先生比王先生的年龄大几岁/ 小几岁。</p>
                            <p>（2）余数问题：分东西有剩余，总数除以几余几，分完缺几个。</p>
                            <p>（3）不定方程问题：未知数多，方程少，2 个未知数 1 个等量关系（1 个方程）。</p>
                            <p>（4）多位数问题：位数存在变化，列方程不好做，考虑代入选项。</p>
                            <p>2.题量：为 10～15 题，80%的同学考查 10 题，20%的同学考查 15 题，省部级以上考查 15 题，地市级以下考查 10 题，题目重叠。</p>
                            <p>3.选项信息充分：选项是一组数，如条件中给出几个数据，问法为分别/各，代入选项验证更方便，如代入甲，则能得到乙，比只给一个数据的题目更适合使用代入排除法，因为正常解题需要设未知数，代入即将未知数当成已知条件。</p>
                            <p>4.给出例题，大家会知道考查代入排除，但是放在卷子中会不清楚哪些题使用代入排除法，所以更多的掌握为什么使用代入排除法。</p>
                        </div>
                        <div class="border-radius">
                            <p>【注意】</p>
                            <p>1.尾数法可以看末尾共有几个 0。</p>
                            <p>2.数学中有和差倍比问题，考查加减乘除，主要考查数学基础、列方程、代数据，和差倍比问题考频高，占比为 20%～30%，即 10～15 题中考查 2～4 题，有套路的为题型，如工程问题、行程问题、经济利润问题。</p>
                            <p>aaaaaaaaaaaaaaaaaaaaaaa</p>
                            <p>aaaaaaaaaaaaaaaaaaaaaaa</p>
                            <p>aaaaaaaaaaaaaaaaaaaaaaa</p>
                            <p>aaaaaaaaaaaaaaaaaaaaaaa</p>
                            <p>aaaaaaaaaaaaaaaaaaaaaaa</p>
                            <p>aaaaaaaaaaaaaaaaaaaaaaa</p>
                            <p>aaaaaaaaaaaaaaaaaaaaaaa</p>
                            <p>aaaaaaaaaaaaaaaaaaaaaaa</p>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>代入排除法</span>
                            </div>
                            <el-tree :data="summary.d1" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>
                    </div>
                </div>
                <div class="section-wrap">
                    <h3 class="text-c section-t" @click="sectionOpenClose('s2')">第二节  倍数特性法</h3>
                    <div class="section-c" v-show="sectionOpen.s2">
                        <div class="border-radius">
                            <p>【注意】倍数特性：用于排除，使用的方法多。</p>
                        </div>
                        <div class="modal-wrap">
                            <h4 class="modal-t">一、基础知识</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】基础知识：</p>
                                    <p>1.A=B*C，B、C 均为整数，A 既能被 B 整除，又能被 C 整除。求的量能写成 2 个数的乘积，一般思路是计算出 2 个数，这是简答题/填空题的思路，公务员考试是选择题，假设其中一个数为 3，可以根据 3 的倍数可以排除答案，假设答案分别为 A.8、B.9、C.10、D.11，只有 B 项满足 3 的倍数，解题时无需计算出 2 个数，即不需要解完题目，可以用倍数特性解题。</p>
                                    <p>2.适用于：</p>
                                    <p>（1）平均分配物品：老师把东西平均分给小朋友，每个小朋友 7 个正好分完，即东西的个数是 7 的倍数，可能只有 1～2 个选项能被 7 整除，剩二代一，假设选项都是 7 的倍数，则可以考虑其他方法解题。若能直接根据 7 的倍数选出答案，则可以秒杀。</p>
                                    <p>（2）平均数：每人分 7 个/平均分 7 个，总个数是 7 的倍数，平均的考法较狭窄。</p>
                                    <p>（3）三量关系，形如 A=B*C；总量=效率*时间，工程问题求总量，总量能被效率、时间整除；路程=速度*时间，S=V*T，假设走了 3 小时，路程能被 3 小时整除；总钱数=单价*个数，假设卖了 9 个，则总价是 9 的倍数，选项 80 不是 9 的倍数，则排除。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【知识点】整除判定：不适用于做题，只是辅助计算，假设答案是 18 的倍
                                        数，无需用所有选项除以 18，可以采用口诀、因式分解、拆分。</p>
                                    <p>1.口诀：优先考虑。</p>
                                    <p>（1）3/9 看各位数字之和，这个点小学奥数学习过，54321 能否被 3 整除，
                                        54321 各位数字之和为 15，15 是 3 的倍数，则 54321 能被 3 整除，15 不是 9 的
                                        倍数，则 54321 不能被 9 整除。</p>
                                    <p>（2）5 看末位，一个数能否被 5 整除，千、百、十都是 5 的倍数，故只看
                                        最后一位能否被 5 整除，即看末位是否为 5 或 0。</p>
                                    <p>（3）4 看末两位，四位数的前两位为百位和千位，100/4，1000/4 均能整除，
                                        故无需看千位和百位，只看十位和个位，即末两位，如 1986 年、2014 年能否被
                                        4 整除，86/4、14/4 均有余数，故 1986 年、2014 年不是 4 的倍数，奥运会的年份均是 4 的倍数（前后 50 年）。</p>
                                    <p>（4）11、13、7 属于 10 年考查一回的数字，不在方法精讲课中讲解，方法
                                        精讲课中讲解高频考点。</p>
                                    <p>2.行测考试中 80%的内容都是小学数学，比高中数学简单。</p>
                                    <p>3.因式分解：数字不是高频考点。</p>
                                    <p>（1）18 是 9 的 2 倍，18=9*2，一个数既能被 9 整除，又能被 2 整除，则该
                                        数能被 18 整除，如 800、1000、1100 都不是 9 的倍数。因式分解后两个数需要
                                        互质，即没有公约数，9、2 除了 1，没有其他公约数，所以 9、2 互质。</p>
                                    <p>（2）假设 18=3*6，一个数能被 3 和 6 整除，但是不一定能被 18 整除，如
                                        12 既能被 3 整除，又能被 6 整除，不能被 18 整除，因为 3、6 有公约数 3，能被
                                        6 整除则一定能被 3 整除。</p>
                                    <p>（3）12=3*4，能被 3 和 4 整除，不能分成 2 和 6，因为 6 已经是 2 的倍数。</p>
                                    <p>（4）45=5*9，不能分解成 3*15，15 已经是 3 的倍数。</p>
                                    <p>（5）因式分解一般针对较大的数字，16 没有分解方法，不能分解成 4*4 或
                                        2*8，直接看即可，近 5 年没有考查 16 的倍数，考查倍数出题人会设计好数字。</p>
                                    <p>4.拆分法：7、13 本身无法分解，即质数。</p>
                                    <p>（1）判断 X 能否被 7 整除，X/7=7 的倍数+零头，看零头能否被 7 整除。如
                                        国考考查等差数列的和，共 7 项，则和为 7 的倍数，选项分别为 A.602、B.623、
                                        C.628、D.631，每个选项除以 7 需要除好几次，A 项 602=630-28，B 项 623=630-7，
                                        C 项 628=630-2，D 项 631=630+1，只有 A 项 602、B 项 623 是 7 的倍数。</p>
                                    <p>（2）找 13 的倍数，排除不是 13 倍数的选项。选项分别为 A.495、B.518、
                                        C.546、D.558，无需每个列算式除以 13，520 是 13 的倍数，选项分别为 A 项=520-25、
                                        B 项=520-2、C 项=520+26、D 项=520+28，只有 26 能被 13 整除，C 项当选。</p>
                                    <p>（3）7、13 等数字估算方法有口诀，但是复杂，不常用容易忘记，考虑拆
                                        分即可。</p>
                                </div>
                            </div>
                        </div>
                        <div class="modal-wrap">
                            <h4 class="modal-t">二、余数型</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】余数型：不是直接整除。</p>
                                    <p>1.一堆苹果分给每人 10 个，剩余 3 个。</p>
                                    <p>2.一堆苹果分给每人 10 个，还缺 3 个。</p>
                                    <p>3.多退少补，多余 3 个即退 3 个，此时正好每人 10 个，总数退 3 是 10 的
                                        倍数。缺 3 个即补 3 个，此时正好每人 10 个，总数补 3 是 10 的倍数。如 83-3
                                        是 10 的倍数，77+3 是 10 的倍数。这种方法能够节省找未知数列方程解方程
                                        的时间，快速解决选择题。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】</p>
                                    <p>1.等差数列求和：（首项+尾项）/2*项数。</p>
                                    <p>2.该类题目最早一次在 2007 年国考中出现过，特点是所有的数的和为定值，
                                        定值分为两部分，一部分是要求的，另一部分内部有比例关系，通过设未知数将
                                        比例关系表示出来，要求的数设为 y，则可得 ax+y=和，所以和-y=ax=a 的倍数。</p>
                                    <p>3.例：假如有 10 个人体重之和为 750kg，其中分成 3 个组，第一组总体重
                                        是第二组总体重的 2 倍，求第三组总体重可能是多少？A.226、B.232、C.237、
                                        D.244。</p>
                                    <p>答：正确答案是选 3 的倍数。总和分为多个部分，一个部分是要求的（第三
                                        组总体重），另一部分是给出了比例关系，即第一组的总体重是第二组总体重的
                                        2 倍，假设第二组体重为 x，第三组体重为 y，则第一组体重为 2x，列式：750=3x+y，
                                        750-y=3x 即 3 的倍数，750 也是 3 的倍数，所以 y 是 3 的倍数，只有 C 项符合。</p>
                                </div>
                            </div>
                        </div>
                        <div class="modal-wrap">
                            <h4 class="modal-t">三、比例型</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】比例型：出题老师自由发挥的空间更大，既可以从分子上想，又可以从分母上想，还可以从和差上想。</p>
                                    <p>1.已知某班：男/女=3/5，问：</p>
                                    <p>（1）男生人数是 3 的倍数。</p>
                                    <p>（2）女生人数是 5 的倍数。</p>
                                    <p>（3）全班人数是 8 的倍数。</p>
                                    <p>（4）男女生人数差是 2 的倍数。</p>
                                    <p>（5）假设分数约掉了 x，即男/女=3x/5x，男生人数是 3x 即 3 的倍数，女
                                        生人数是 5x 即 5 的倍数，全班人数是 3x+5x=8x 即 8 的倍数，男女生人数差是
                                        5x-3x=2x 即 2 的倍数。</p>
                                    <p>2.A/B=m/n（m、n 互质，没有公约数）。m/n 是最简整数比，如男/女
                                        =3/5=30000/50000，但真实人数不会有几万人，不能说男生是 30000 的倍数，女
                                        生是 50000 的倍数，所以要化成最简整数比分析。如果不是最简整数比，做出来
                                        的答案就有问题了。</p>
                                    <p>（1）A 是 m 的倍数。</p>
                                    <p>（2）B 是 n 的倍数。</p>
                                    <p>（3）A+B 是 m+n 的倍数。</p>
                                    <p>（4）A-B 是 m-n 的倍数。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【知识点】比例的常见形式：</p>
                                    <p>1.男生是女生的 3/5（分数）。</p>
                                    <p>2.男生与女生之比为 3：5（比例）=3/5。</p>
                                    <p>3.男生是女生的 60%（百分数）=60/100=3/5。</p>
                                    <p>4.男生是女生的 0.6 倍（倍数）=0.6/1=6/10=3/5。</p>
                                    <p>5.看到比例、百分数、倍数时可用比例的方法。</p>
                                    <p>6.公倍数的算法：5、6、8 没有公共的约数，提出 6、8 的公因子 2，剩余 5、3、4，此时完全互质，全部相乘：2*5*3*4=120。</p>
                                </div>
                            </div>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>倍数特性法</span>
                            </div>
                            <el-tree :data="summary.d2" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>
                    </div>
                </div>
                <div class="section-wrap">
                    <h3 class="text-c section-t" @click="sectionOpenClose('s3')">第三节  方程法</h3>
                    <div class="section-c" v-show="sectionOpen.s3">
                        <div class="border-radius">
                            <p>【知识点】普通方程→未知数个数=方程个数，方程可解，是定方程；未知
                                数个数＞方程个数（最典型的是两个未知数、一个方程的情况）→不定方程，利
                                用数字特性快速排除。设未知数技巧：</p>
                            <p>1.设小不设大（减少分数计算）。如：甲=3 乙，设乙为 x，甲为 3x。甲比乙多 5 个，设乙为 x，甲为 x+5，不建议设成减法形式（甲为 x，乙为 x-5），尽量
                                避免分数计算、减法计算</p>
                            <p>2.设中间量（方便列式）。题目中量比较多，设 3 或 4 个未知数，需要列出
                                3 或 4 个方程，甲乙有关，乙丙有关，乙丁有关，设乙为 x，据此表示出其他量。</p>
                            <p>3.问谁设谁（避免陷阱）：不能用前面两种时使用。</p>
                            <p>4.例如：甲：乙=3：2，为避免小数、分数，设甲为 3x，乙为 2x。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】不定方程：ax+by=M。</p>
                            <p>1.方法：分析奇偶、倍数、尾数等数字特性，结合选项排除。</p>
                            <p>2.奇偶：</p>
                            <p>（1）ax+by=M，两个未知数，一个方程，是不定方程，当系数 a、b 恰好一奇一偶时，考虑奇偶特性。偶数倍 x→一定是偶数，奇数倍 x→奇偶不定。</p>
                            <p>（2）引例：3x+4y=25，x=？（x、y 均为正整数）</p>
                            <p>A.2 &nbsp;&nbsp; B.3 &nbsp;&nbsp; C.4 &nbsp;&nbsp; D.5</p>
                            <p>答：系数 3、4 一奇一偶，考虑奇偶特性，25 是奇数，4y 是偶数，奇数+偶
                                数=奇数，3x 是奇数，则 x 只能为奇数，排除 A、C 项；剩二代一，代入 B 项：x
                                =3，解得：y=4，x、y 都是正整数，满足所有条件，B 项当选。</p>
                            <p>3.倍数：</p>
                            <p>（1）ax+by=M，当 a 或 b 与 M 有公因子时（公因子=公约数），考虑倍数特性。</p>
                            <p>（2）例：7x+3y=60，x+y 最大为多少？（x、y 均为正整数）</p>
                            <p>A.12 &nbsp;&nbsp; B.13 &nbsp;&nbsp; C.16 &nbsp;&nbsp; D.18</p>
                            <p>答：7 是质数，60、3 有公因子 3，则 7x 也有公因子 3，移项：7x=60-3y=3
                                *（20-y）=3*整数，7x 一定是 3 的倍数，则 x 是 3 的倍数，包括 3、6、9……，
                                x=3 时，y=13，问最大，此时加和为 16，排除比它小的 A、B 项；x=6 时，y=6，
                                加和＜C 项；x=9 时，y 为负，加和更小，C 项最大。</p>
                            <p>4.尾数：</p>
                            <p>（1）ax+by=M，当 a 或 b 尾数是 0 或 5 时，考虑尾数特性。</p>
                            <p>（2）例：37x+20y=271，x=？（x、y 均为正整数）</p>
                            <p>A.1 &nbsp;&nbsp; B.3 &nbsp;&nbsp; C.2 &nbsp;&nbsp; D.4</p>
                            <p>答：20y 的尾数为 0，271 的尾数为 1，则 37x 的尾数为 1，3*7=21，可知 x
                                的尾数为 3，对应 B 项。尾数可能有多种情况，不一定可以得到唯一答案，如：
                                4x=×2，x 的尾数可以是 3 或 8。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】不定方程组：通常是 3 个未知数、2 个方程。</p>
                            <p>1.第一类：未知数一定是整数。`a_1X＋b_1Y＋c_1Z＝M`，`a_2X＋b_2Y＋c_2Z＝N`。</p>
                            <p>2.方法：先消元转化为不定方程，再按不定方程求解。</p>
                            <p>3.例：`3X＋b_1Y＋c_1Z＝M①`，`6X＋b_2Y＋c_2Z＝N②`。②-①*2 消去 X，之后按照不定方程求解。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】不定方程组：</p>
                            <p>1.第二类：未知数不一定是整数，比如：时间、钱数可能取小数。</p>
                            <p>2.方法：</p>
                            <p>（1）特值法（一般赋零）：对于未知数不一定是整数的不定方程组，可以赋
                                其中 1 个未知数为零，进而快速计算出其他未知数。</p>
                            <p>（2）配系数。中学做法，①*？+②*？→所求，无需掌握。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】不定方程组：</p>
                            <p>1.第一类：未知数一定是整数。</p>
                            <p>2.方法：先消元转化为不定方程，再按不定方程求解。</p>
                            <p>3.第二类：未知数不一定是整数（时间、钱数）。</p>
                            <p>4.特值法（一般赋零）：</p>
                            <p>（1）对于未知数不一定是整数的不定方程组，可以赋其中 1 个未知数为零，
                                进而快速计算出其他未知数。</p>
                            <p>（2）配系数：中学做法，无需掌握</p>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>方程法</span>
                            </div>
                            <el-tree :data="summary.d3" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>
                    </div>
                </div>
                <div class="section-wrap">
                    <h3 class="text-c section-t" @click="sectionOpenClose('s4')">第四节 工程问题</h3>
                    <div class="section-c" v-show="sectionOpen.s4">
                        <div class="border-radius">
                            <p>【知识点】工程问题：</p>
                            <p>1.三量关系：总量=效率*时间。</p>
                            <p>（1）总量：工作到底做多少，例如：上课 180 分钟、做多少道题，都是工
                                作量。</p>
                            <p>（2）效率：单位时间内做的工作量，其中单位时间要看题干条件，有时为
                                一天的效率、有时为 1 小时的效率、有时为 1 分钟的效率。</p>
                            <p>（3）时间：总量/效率，例如：唐宋老师需要搬砖 1000 块，每小时搬砖 200
                                块，则 5 小时搬完。</p>
                            <p>（4）已知其中的两个量，一定可以求出第三个量。绝大多数的工程问题（90%）
                                都是问时间，此时只要找到总量和效率，效率=总量/时间。</p>
                            <p>2.考查题型：一共分为四种题型，前三种为主要的题型，第四种为特殊的考
                                法。</p>
                            <p>（1）给完工时间型：工程问题的基础，比较常见，难度不高，比较简单。</p>
                            <p>&nbsp;&nbsp;- ①赋总量（完工时间的公倍数）。</p>
                            <p>&nbsp;&nbsp;- ②算效率：效率＝总量/时间。</p>
                            <p>&nbsp;&nbsp;- ③根据工作过程列方程或式子。</p>
                            <p>&nbsp;&nbsp;- ④引例.要折叠一批纸飞机，若甲单独折叠要半个小时完成，乙单独折叠需
                                要 45 分钟完成。若两人一起折，需要多少分钟完成？</p>
                            <p>A.10 &nbsp;&nbsp; B.15 &nbsp;&nbsp; C.16 &nbsp;&nbsp; D.18</p>
                            <p>【解析】引例.题干没有告诉纸飞机的总量，一般 90%的工程问题不会告诉
                                工程总量，此时可以赋值（假设一个工作量）。题干没有纸飞机的总量，题干也
                                没有问纸飞机的总量，说明和纸飞机的总量和答案没有关系，如果和答案有关系，
                                但是题目没给，此时该题就无法做出来，是一道错题。（1）为了好算，尽量假设
                                总量为完工时间的公倍数，半个小时为 30 分钟，30 和 45 的公倍数为 90，假设
                                总量为 90 个；（2）根据总量计算效率，P 甲=90/3=3 个/分钟，P 乙=90/45=2 个/
                                分钟；（3）根据工作过程列式子，90 个/[（3+2）个/分钟]=18 分钟，对应 D 项。
                                【选 D】</p>
                            <p>（2）给效率比例型。</p>
                            <p>（3）给具体单位型。</p>
                            <p>（4）同时开始同时结束。</p>
                        </div>
                        <div class="border-radius">
                            <p>【例 2】（2019 河北）甲、乙两队单独完成某项工程分别需要 10 天、17 天。
                                甲队与乙队按天轮流做这项工程，甲队先做，最后是哪队第几天完工？</p>
                            <p>A.甲队第 11 天 &nbsp;&nbsp; B.甲队第 13 天 &nbsp;&nbsp; C.乙队第 12 天 &nbsp;&nbsp; D.乙队第 14 天</p>
                            <p>【解析】例 2.该题比较特殊，国考和联考都考过轮流的问题，但是近五年
                                每怎么考，该题（2019 年河北）考到了轮流。（1）已知“甲、乙两队单独完成
                                某项工程分别需要 10 天、17 天”，10 和 17 之间没有公约数，所以设工程总量为
                                10*17=170；（2）算效率，P 甲=17，P 乙=10；（3）难点在于工作过程比较特殊，已
                                知“甲队与乙队按天轮流做这项工程”，第一天只有甲做，第二天只有乙做，一
                                个循环中，第一天甲干，第二天乙干，看有几个循环，170/（17+10）=170/27=6……
                                8。这里的 6 为循环的个数，余数 8 和被除数是一个概念，总量为 170 份工作，
                                则剩下 8 份工作。前面 6 个循环均为甲乙、甲乙……，剩下的 8 份开启第 7 个循
                                环，每个循环开始甲开始做，所以最后的 8 份工作由甲做完，排除 C、D 项；每
                                个循环用时 2 天，所求=2*6 天+甲做的天数=12 天+1 天=13 天，所以最后甲队第
                                13 天完工，对应 B 项。【选 B】</p>
                            <p></p>

                            <p>【注意】</p>
                            <p>1.千万不要写为 170/27=6`8/27`个循环，循环是不均匀的，不是每一分每一秒都
                                是甲、乙平摊的。`8/27`意为平均分成 27 份，取了其中的 8 份。这样做题是不对的，
                                相当于把循环看成了均匀的概念，一个循环中，可能前面快一点后面慢一点，或者后面快一点前面慢一点。时间并不一定可以写成分数。循环只有一种写法：总
                                量/循环的量=若干个循环……余数。这样思考：整数的循环对应整数的天数，余
                                下的部分看是谁先干，该题中是甲先干，甲的效率为 17，1 天可以干完 8 份，所
                                以用时 1 天。</p>
                            <p>2.如果余数为 18，甲的效率只有 17，甲 1 天干不完，还需要乙再做 1 天，
                                相当于甲再第 13 天做了 17 份，剩下的 1 份，需要乙在第 14 天才能做完。此时
                                选择 D 项。</p>
                            <p>3.给完工时间型，做法比较固定，一般给出两个人或者三个人单独的完工时
                                间，根据完工时间赋值工作总量，然后计算出每个人的效率，最后分析工作过程。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】给效率比例型：</p>
                            <p>1.赋效率（满足比例即可）。</p>
                            <p>2.算总量：总量=效率*时间。</p>
                            <p>3.根据工作过程列方程或式子。</p>
                            <p>4.引例.甲和乙的效率比为 2：3，甲、乙合作完成一项工程需要 10 天，如
                                果甲单独做这项工程需要多少天？</p>
                            <p>A.15 &nbsp;&nbsp; B.20 &nbsp;&nbsp; C.25 &nbsp;&nbsp; D.30</p>
                            <p>【解析】引例.发现题干只有 1 个时间，两个数以上才能求公倍数，没有告
                                诉效率的具体值，只给了比例，（1）根据“甲和乙的效率比为 2：3”，可以赋值
                                效率，甲的效率为 2，乙的效率为 3；（2）已知“甲、乙合作完成一项工程需要
                                10 天”，工作总量=（2+3）*10 天=50；（3）分析工作过程，问“甲单独做这项工
                                程需要多少天”，50/2=25，对应 C 项。【选 C】</p>
                            <p>5.给效率比例的几种不同形式：</p>
                            <p>（1）直接型：甲的效率是乙的 1.5 倍。可以写甲的效率为 1，乙的效率为
                                1.5，但是建议写成整数，甲/乙=1.5=3/2，则甲的效率为 3，乙的效率为 2。</p>
                            <p>（2）间接型：甲 3 天的工作量相当于乙 4 天的工作量。题干没有出现“效
                                率”这个词，只说“工作量……”。“相当于”就是等于的意思。`P_甲*3 天=P_乙*4天`，
                                乘积一定的情况下，时间越小，效率越高，时间和效率成反比，`P_甲：P_乙=4：3`。此时可以设甲的效率为 4，乙的效率为 3。还不熟悉的时候，可以一步一步分
                                析，题目做多了以后，量一定，时间和效率成反比，直接写 `P_甲：P_乙=4：3`。</p>
                            <p>（3）特殊型：某农场有 36 台收割机，或者 36 名工人。有若干名工人/机器，
                                其中“若干”为具体的数量。每个工人/每台机器的效率没有区别（实际情况是
                                有区别的，但是题目中默然效率是一样的）。一般为了方便，一个人的效率为 1，
                                36 个人的效率为 36；每台机器的效率为 1，36 台机器的效率为 36。</p>
                            <p>（4）考查最多的为间接型。直接型就是按照比例关系直接设效率；间接型
                                一般是总量相当，时间和效率反过来；特殊型一般设每个人/每台机器效率为 1。</p>
                        </div>
                        <div class="border-radius">
                            <p>【注意】</p>
                            <p>1.例如：放寒假，本来可以正常写完作业，但是在写作业的过程中遇到了春
                                节，有 5 天的时间无法写作业，最后 8 天的时候拼命赶作业，如果按期把作业交
                                上去，每天需要写多少作业，最后 8 天要写的作业：正常 8 天要写的作业+5 天
                                没写的作业=13 天的作业。</p>
                            <p>2.该题也是 2018 年国考的题目，辽宁省考只不过是改了一下数字，做题思
                                路和国考题是一模一样的。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】给具体单位型：例如：搬 1000 块砖，此时已知工作量，但是例
                                1～例 5 没有出现过具体的工作量（具体单位），前面用赋值的方法把工作量假设
                                出来，然后做题。出现总工作量或者 200 块砖/小时，出现具体工作量或者具体
                                效率，此时可以设未知数列方程。为什么还要设未知数，因为题干不可能把所有
                                的数值均告诉我们，例如：已知甲每小时比乙多搬砖 200 块，甲、乙的效率未知，
                                但是已知甲、乙效率的差，此时设乙为 x，甲为 200+x。或者一直甲效率和乙效
                                率的和为 200，则设一个为 x，另一个为 200-x。</p>
                            <p>1.设未知数（设小不设大或设中间量）。</p>
                            <p>2.找等量关系列方程。等量关系只有一种：量=效率*时间。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】同时开始同时结束：</p>
                            <p>1.典型情况：三个人做两项工作，要求同时开工同时结束。例如：第一项工
                                作甲负责，第二项安排乙来负责，丙一会帮甲干，一会帮乙干，要求两项工作同
                                时开工同时结束。</p>
                            <p>2.核心思路：所有的人全程没有休息，工作时间＝两项工作的工作量之和/
                                三个人的效率之和。简单记忆：工作时间=工作量之和/效率之和。例如：A 项工
                                作为 100 块砖，B 项工作为 200 块砖，安排甲、乙、丙三人去做，甲每分钟干 3
                                块，乙每分钟干 4 块，丙每分钟干 5 块，甲负责干 A 项工作，乙负责干 B 项工作，
                                丙是负责帮忙的，整个过程中，中途不休息，三人的 t 一样，`P_甲*t+P_乙*t+P_丙*t=A 量+B 量`，3t+4t+5t=100+200=300，t=300/（3+4=5）=25 分钟。</p>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>工程问题：前两种是工程问题的主流考法。</span>
                            </div>
                            <el-tree :data="summary.d4" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>
                    </div>
                </div>
                <div class="section-wrap">
                    <h3 class="text-c section-t" @click="sectionOpenClose('s5')">第五节 行程问题</h3>
                    <div class="section-c" v-show="sectionOpen.s5">
                        <div class="border-radius">
                            <p>【知识点】行程问题：</p>
                            <p>1.三量关系：路程=速度*时间。</p>
                            <p>2.考查题型：</p>
                            <p>（1）基础行程：基本公式考查：路程=速度*时间（S=vt）。</p>
                            <p>（2）相对行程，非常重要，比如相遇、追及、船在水中运动，多次相遇追
                                及（两个主体存在相对运动）。</p>
                            <p>（3）比例行程，从正比、反比的角度考虑。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】隧道过桥：火车经过隧道/桥，火车不能看作一个点过桥。考查方式：</p>
                            <p>1.完全过桥：从车头上桥开始，到车尾下桥结束。分析一个不能看作点的物
                                体，可以从同一个部位分析，比如看车头到车头（或者看车尾到车尾），运动路
                                程包括桥长和车自身的长度。公式：`桥长+车长=v_车*t_(过桥)`。</p>
                            <p>2.整列火车都在桥上：从整个火车上桥，到车头要离开桥时结束。整个路程
                                比桥长少了一个车身长度，即运动路径为桥长-车长。公式：`桥长-车长=车*t_(在桥)`</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】基础行程：</p>
                            <p>1.基本公式考查：路程=速度*时间</p>
                            <p>2.平均速度=总路程/总时间。</p>
                            <p>（1）比如 A→B，去的速度是 100，回来速度是 60，则来回的平均速度不是
                                （100+60）/2=80。考试遇到，可以把 80 当作是一个错误答案排除。</p>
                            <p>（2）比如来会的路程都是 300，去的时间是 3 分钟，回来的时间是 5 分钟，
                                整个 8 分钟的运动中，只有 3 分钟（不到一半的时间）是 100 的速度，超过一半
                                的时间是 60 为速度，只有来和回都是 4 分钟的时候，才能用相加除以 2 计算平
                                均值，因此答案更靠近 60。</p>
                            <p>（3）平均速度=（300+300）/（3+5）=75 米/分钟。</p>
                            <p>3.等距离平均速度公式：`\overline(v)=2v_1v_2/(v_1+v_2)`。</p>
                            <p>（1）`\bar(v)=2v_1v_2/(v_1+v_2)`，可以记作：2 积/和。比如上述例子，可以直接用
                                2*60*100/（60+100）=75。推导：`（S_去+S_回）÷（S/v_1+S/v_2）`，化简可得`\bar(v)=2v_1v_2/(v_1+v_2)`。</p>
                            <p>（2）注意：只有 S 相同才能用，如果去和回的路程不同则不能用，比如去
                                是走直线去，回是走曲线回，则不能套用此公式。</p>
                            <p>（3）常适用于：直线往返、上下坡往返。上下坡往返，是指 A→B，有上坡、有下坡，需要“翻山越岭”，这种情况下的往返，可以直接用公式。如果是去上
                                坡，回来变成下坡，依旧是直线距离，则属于直线往返。</p>
                            <p>①去的速度为 `v_上`，返回速度为 `v_下`，每一段都是来回各走一遍，每一段可以
                                用平均速度的公式计算。比如每段路程的平均速度都是 75，则全程的平均速度
                                就是 75。</p>
                            <p>②不论上下坡几次，都可以套用此公式。每段的坡距离不一定相同。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】相对行程：</p>
                            <p>1.直线相遇：两人方向相对，同时相向而行。</p>
                            <p>2.公式：`S_和=v_和*t_遇`。`S_和`：就是两人走的路程之和。</p>
                            <p>3.两人在直线两点出发，左边速度为 v1，右边速度为 `v_2`，经过相同的时间 t
                                到达相遇点，可以得到 `v_1t+v_2t=S_和`→`(v_1+v_2)t=S_和`→`v_和 t_遇=S_和`。</p>
                            <p>4.注意：这种题型考虑的是路程，不是物理概念中的“位移”</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】直线追及：同时同向而行。</p>
                            <p>1.公式：`S_差=v_差*t_追`。`S_差`：追及刚开始时两人相差的距离。</p>
                            <p>2.同一个方向，才能是追及。开始起点，两人要有一个距离差，如果在一起
                                出发，就不能说“追及”。因此开始要有距离（虚线表示）。后面的人速度一定比
                                前面的人速度大，才能追上，因此前面人速度为 `v_小`，后面人速度为 `v_大`，蓝色路
                                程为 `v_小 t_追`，红色路程为 `v_大 t_追`，红色路程比蓝色路程多出部分就是开始两人的
                                路程差，故 `S_差=v_大 t-v_小 t`→`S_差=v_差*t_追`。</p>
                            <p>3.考试如果计算追及时间，只要找两人开始的路程差和两人的速度差。</p>
                        </div>
                        <div class="border-radius">
                            <p>【注意】</p>
                            <p>1.赋值多少不影响计算，赋值其他也可以做。</p>
                            <p>2.第一个追及过程，`S_间`是 12 的倍数，第二个追及过程，`S_间`是 18 的倍数，
                                路程既是 12 的倍数，又是 18 的倍数，故本题赋值间距为 36</p>
                            <p>3.本题有的同学担心，跑了 12 分钟之后，三人的位置关系会不会改变，如果有这种想法，题目 10 分钟可能做不完。行程问题，最关键的是“回到起点”
                                考虑。因此行程问题的思维，是考虑“追及刚开始时两人相差的距离”。</p>
                            <p>4.出现“再过多少分钟”的描述，很大概率会有陷阱，可以利用陷阱以坑治
                                坑。许多同学会忘记减掉 18 分钟，因此可以观察选项是否有差 18 分钟的，D 项
                                -18=C 项，则 D 项是从开始到追及的时间，C 项是再过的时间，故 C 项为所求。
                                考试能做要以做题为主，不能做再蒙。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】环形问题：大部分都是同点出发，不同点是少数。</p>
                            <p>1.环形相遇（同点反向出发）。</p>
                            <p>（1）公式：`S_和=v_和*t_遇`。</p>
                            <p>（2）相遇 1 次，`S_和=1圈`；相遇 N 次，`S_和=N 圈`。</p>
                            <p>&nbsp;&nbsp;- ①比如第一次相遇，左边走 `v_1t`，右边走 `v_2t`，合起来是全程，即 `v_1t+v_2t=1圈`→`v_和 t=1 圈`</p>
                            <p>&nbsp;&nbsp;- ②如果是相遇 n 次，路程和为 n 圈</p>
                            <p>（3）本质：每一次相遇到下一次相遇期间，两人走的路程和是一圈。第一
                                次相遇，记作①；之后两人继续走，第二次相遇，记作②；第一次相遇到第二次
                                相遇过程中，两人的路程又构成一个封闭的圆。因此每次相遇，到下一次相遇，
                                两人的路程和都是 1 圈。</p>
                            <p>（4）数学中的环形，不一定是圆形，只要是首尾相连（圆形、椭圆形、长
                                方形等），就是环形，封闭图形就是环形。</p>
                            <p>2.环形追及（同点同向出发）。</p>
                            <p>（1）公式：`S_差=v_差*t_追`。</p>
                            <p>（2）追上 1 次，`S_差=1 圈`；追上 N 次，`S_差=N 圈`。</p>
                            <p>&nbsp;&nbsp;- ①比如中学的体育课，A 在前面跑，B 要从背后追上 A，是因为 B 先跑完一
                                圈，B 后面跑的路程和 A 跑的路程相等，追上一次，路程差为 1 圈。比如第一个
                                人跑 200 米，第二个人要跑 1 圈+200 米才能追上。</p>
                            <p>&nbsp;&nbsp;- ②追上 n 次，路程差为 n 圈。本质：每一次追上到下一次追上期间，两人走
                                的路程差是一圈。比如第 n 次追上到第 n+1 次追上，快的人跑一整圈+△表示的
                                距离，慢的人只跑了△的距离。</p>
                            <p>（3）注意：公式中，追及是 `S_差=v_差 t`，相遇是` S_和=v_和 t`。`S_和`、`S_差`都是 1 圈。</p>
                        </div>
                        <div class="border-radius">
                            <p>【注意】异向、相向、反向，都是相遇问题。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】多次迎面相遇（两端出发）：</p>
                            <p>1.从两端出发：</p>
                            <p>（1）第 1 次相遇，共走 1 个 S。</p>
                            <p>（2）第 2 次相遇，共走 3 个 S。</p>
                            <p>（3）第 3 次相遇，共走 5 个 S。</p>
                            <p>2.第 n 次相遇，共走 `S_和=（2n-1）S=V_和*t_遇`。</p>
                            <p>3.例：牛郎和织女从两端出发，第一次相遇共走了 1S；相遇的时候没认出
                                来，两人继续走，到达对方出发点的时候往回走，第二次相遇共走了 3S；第二
                                次相遇还是错过了，继续往前走，第三次相遇共走了 5S。</p>
                            <p>4.考试的时候可能问第二次、第三次相遇用了多久，代入公式即可。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】流水行船：流水行船问题，在考试中考的不多，是低频考点，并且难度比较低，</p>
                            <p>1.`V_顺=V_船+V_水`。</p>
                            <p>2.`V_逆=V_船-V_水`。</p>
                            <p>3.静水速度=船速、漂流速度=水速。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】比例行程：</p>
                            <p>1.三量关系：路程 S=速度 V*时间 T。</p>
                            <p>2.S 一定，V、T 成反比。比如例 6，在联考中也出现过类似的题，从 A 点到
                                B 点用了 90 分钟，从 B 点到 A 点用了 100 分钟，则速度比为 10：9。</p>
                            <p>3.V 一定，S、T 成正比。</p>
                            <p>4.T 一定，S、V 成正比。</p>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>行程问题</span>
                            </div>
                            <el-tree :data="summary.d5" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>
                    </div>
                </div>
                <div class="section-wrap">
                    <h3 class="text-c section-t" @click="sectionOpenClose('s6')">第六节 经济利润问题</h3>
                    <div class="section-c" v-show="sectionOpen.s6">
                        <div class="modal-wrap">
                            <h4 class="modal-t">一、基础经济</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】</p>
                                    <p>1.利润（盈利）=售价-进价（成本），定义式。</p>
                                    <p>2.利润率=利润/进价（数量关系）。资料分析：利润率=利润/营业收入。利
                                        润率这个概念在经济学上一种是成本利润率（成本作为分母），另一种是收入利
                                        润率（营业收入作为分母）。数学研究的是比较理想化的情况，成本都比较清晰；
                                        资料分析是研究现实中的数据（如研究一个国家、地区的整体利润率），比较难
                                        以计算成本，营业收入很透明，因此可以用营业收入进行分析。资料分析里面的
                                        利润率一定小于 100%，是一个比重的概念，利润是营业收入的一部分。</p>
                                    <p>3.售价=进价*（1+利润率），推导：售价=进价+利润=进价+进价*利润率=进
                                        价*（1+利润率）。如进价为 100，利润率为 50%，售价=100*150%=150。</p>
                                    <p>4.折扣=折后价/折前价。比如打折之前卖 100，打折之后卖了 80，折扣
                                        =80/100=80%，打 8 折，打 85 折就是 85%。如果题目这样表述：老板给一个 20%
                                        的折扣，此时是原价降低 20%，相当于打 8 折，售价为原价的 80%。
                                        </p>
                                    <p>5.总价=单价*数量，总进价=单个进价*数量，总利润=单个利润*数量=总售
                                        价-总进价。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】“上涨 300%”就是增长 300%，利润率为 300%。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】解题思路梳理：</p>
                                    <p>1.方程法：有具体价格（总价、单价、利润）。</p>
                                    <p>2.赋值法：</p>
                                    <p>（1）给比例，求比例（整个题目没有给具体数值）。</p>
                                    <p>（2）三量关系只给一个量（总价=单价*数量）。</p>
                                    <p>（3）操作方式：对条件和问题都没有给具体值的量进行赋值即可。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】题目都是百分数，没有具体单位，可以采用赋值法。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】如果 A/B=C/D，则 A/B=C/D=（A+C）/（B+D）=（A-C）/（B-D）。
                                    </p>
                                    <p>1.例如：（x-5）/5=（x-7）/6=[（x-5）-（x-7）]/（5-6）=2/-1=-2，则
                                        x-5=5*（-2），解得 x=-5，不需要交叉相乘展开，分子、分母做差的顺序需要保
                                        持一致。</p>
                                    <p>2.本题方法一：（x-105）/100=（x-104）/104=[（x-104）-（x-105）]/（1
                                        04-100）=1/4，则 x-105=100*1/4，x=130。</p>
                                </div>
                            </div>
                        </div>
                        <div class="modal-wrap">
                            <h4 class="modal-t">二、分段计费</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】分段计费：</p>
                                    <p>1.在生活中，水电费、出租车计费等，每段计费标准不等。问：在不同收费
                                        标准下，一共需要的费用？</p>
                                    <p>2.计算方法：</p>
                                    <p>（1）先按标准分开看。
                                    </p>
                                    <p>（2）计算之后再汇总。</p>
                                    <p>3.某地出租车收费标准为：3 公里内起步价 8 元；超出 3 公里的部分，每公
                                        里 2 元。小明打车坐了 12 公里，共花费多少钱？</p>
                                    <p>答：前面 3 公里为起步价 8 元，后面还有 12-3=9 公里，共花费 8+9*2=26
                                        元。本题为最简单的分段计费问题。</p>
                                </div>
                            </div>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>经济利润问题</span>
                            </div>
                            <el-tree :data="summary.d6" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>

                    </div>
                </div>
                <div class="section-wrap">
                    <h3 class="text-c section-t" @click="sectionOpenClose('s7')">第七节 最值问题</h3>
                    <div class="section-c" v-show="sectionOpen.s7">
                        <div class="modal-wrap">
                            <h4 class="modal-t">一、函数最值</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】函数最值：经济利润问题中的特殊情况。
                                    </p>
                                    <p>1.判定题型：单价和销量此消彼长，问何时总价/总利润最高？</p>
                                    <p>2.引例：单价为 3000 元，可卖出 16 万件。若单价每提升 300 元，销量会降
                                        低 1 万件。请问当单价定为多少元时，销售总额最高？</p>
                                    <p>答：单价和销量此消彼长，问总价/总利润最高，想要销售总额最高，销售
                                        总额=单价*数量，设提价次数为 x，则单价变为 3000+300x，销量变为（16 万件
                                        -x 万件），总额=（3000+300x）*（16 万件-x 万件），想要总额最大，代入很浪
                                        费时间。可以直接令总额为 0，从而使 3000+300x=0，16-x=0，解得 `x_1=-10`，`x_2=16`。
                                        则 `x=(x_1+x_2)/2=3` 时，销售总额取得最值，此时的单价为 3000+300*3=3900 元。</p>
                                    <p>3.计算方法（两点式）：</p>
                                    <p>（1）设提价次数为 x。</p>
                                    <p>（2）令总利润/总售价为 0，解得 `x_1`、`x_2`。</p>
                                    <p>（3）当 `x=(x_1+x_2)/2` 时，取得最值。</p>
                                    <p>4.二次函数：当 x=-b/2a 时有最值；或是求导。</p>
                                    <p>两点式原理：总数=（ ）*（ ），两个括号内一定一正一负，故得到-x²，
                                        函数一定是开口向下的抛物线，在抛物线的一左一右找到函数值为 0 的点，而这
                                        两个点的平均值就在对称轴上。</p>
                                </div>
                            </div>
                        </div>
                        <div class="modal-wrap">
                            <h4 class="modal-t">二、构造数列</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】构造数列（某个主体最……）：套路性很强，偶尔会有变化。</p>
                                    <p>1.5 个人分 423 斤肉，分到的重量均为整数且互不相等。分得最多的人，最
                                        少分（ ）斤。</p>
                                    <p>答：“分得最多的人”指名次是第一名，“最少分多少斤”指数量最少，即要让第一名最少。先对 5 人进行排名（第一～第五），求谁设谁，问第一名，则设
                                        第一名为 x。总量一定，要让 x 尽量少，则其他人要尽量多，分到的重量均为整
                                        数且互不相等，第二名最多为 x-1，第三名最多为 x-2，第四名最多为 x-3，第
                                        五名最多为 x-4。求和列式：5x-10=423，解得 x=86.6。问的是最少，说明最少
                                        为 86.6，不能比 86.6 更少（≥86.6），反向取整为 87。如果 x 是整数，计算出
                                        的数据就是答案。
                                        </p>
                                    <p>2.方法：求谁设 x——反向推其它——求和列式。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】</p>
                                    <p>1.大于 x 且尽可能大：往封顶取；大于 x 且尽可能小：x+1、x+2……。</p>
                                    <p>2.小于 x 且尽可能大：x-1、x-2……；小于 x 且尽可能小：1、2、3……。</p>
                                    <p>3.如果 x 在中间，基本上都是一边是常数，一边是未知数。
                                    </p>
                                </div>
                            </div>
                        </div>
                        <div class="modal-wrap">
                            <h4 class="modal-t">三、最不利构造</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】最不利构造（至少……保证……）：考查较少，套路性强。</p>
                                    <p>1.袋子中装有 5 个红球，8 个白球，10 个黄球。问：</p>
                                    <p>（1）至少取出（ ）个，才能保证有红球？</p>
                                    <p>答：要保证有红球，考虑最倒霉的情况，先摸出 8 白+10 黄，此时再摸一个
                                        肯定是红球，8+10+1=19。</p>
                                    <p>（2）至少取出（ ）个，才能保证至少有 3 个同色的球？</p>
                                    <p>答：要保证有 3 个同色的球，最倒霉的情况是每种颜色都摸 2 个，即 2 红+2
                                        白+2 黄，此时再摸一个，一定可以满足要求，2+2+2+1=7。
                                        </p>
                                    <p>（3）至少取出（ ）个，才能保证至少有 8 个同色的球？</p>
                                    <p>答：要保证有 8 个同色的球，考虑最倒霉的情况，红球只有 5 个，全取出来，
                                        5 红+7 白+7 黄，此时再摸一个，一定可以满足要求，5+7+7+1=20。
                                        </p>
                                    <p>2.方法：要保证同种情况至少 n 个，应每种情况各取（n-1）个（如果有不
                                        够 n-1 的有多少取多少），最后再加 1。</p>
                                </div>
                            </div>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>最值问题</span>
                            </div>
                            <el-tree :data="summary.d7" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>

                    </div>
                </div>
                <div class="section-wrap">
                    <h3 class="text-c section-t" @click="sectionOpenClose('s8')">第八节 容斥原理</h3>
                    <div class="section-c" v-show="sectionOpen.s8">
                        <div class="border-radius">
                            <p>【知识点】容斥原理：</p>
                            <p>1.在中学中，容斥原理属于集合的概念。</p>
                            <p>（1）集合：把具有同一属性的所有元素放在同一圆圈中。</p>
                            <p>（2）两种有交叉有融合，属于两集合容斥原理问题；三种有交叉有融合，
                                属于三集合容斥原理问题。</p>
                            <p>2.两集合容斥公式：A+B-A∩B=总数-都不。</p>
                            <p>3.如下图所示：例如，全班有 50 人，35 人参加国考，38 人参加省考，30
                                人既参加省考又参加国考。还有一部分人两种考试都不参加，属于圆圈外的范围，
                                为“都不”，问“都不”有多少人。两种有交叉有融合，属于两集合容斥原理。
                                参加国考的人数为 A，参加省考的人数为 B，参加国考人数+参加省考人数
                                =35+38=73＞总人数 50 人，因为其中有一部分人（30 人）被重复计算，30 人被
                                算了 2 次，要减去重复计算的人数，35+38-30。A∪B=A+B-A∩B=35+38-30，“并
                                集”的概念大家了解即可，因为公考不考，这里是为了和中学的知识点产生联系。
                                35+38-30=50-（ ），一般来说，选项尾数不同，利用尾数法，尾数 3=尾数 0-（ ）的尾数，则（ ）的尾数为 7。</p>
                            <p>4.考试中把“补集”理解为“都不”。就是哪个集合都不属于，这样描述比
                                较接地气。只理解交集（∩）的概念即可。
                                </p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】画图法：</p>
                            <p>1.若条件或问题不便于代入公式计算，则考虑画图。
                            </p>
                            <p>2.例如：只参加 A；参加 A、B 但不参加 C；或者缺少代公式必要的数据。如
                                图所示：左边的圆圈为 A，阴影部分为只 A，但是阴影部分在公式中是不存在的，
                                公式中的 A 为“圆圈”代表的区域，出现和公式表述不同的，就用画图法。</p>
                            <p>3.先画圈，再代数；从里到外，注意去重。例如：A∩B=5 人，A 的人数为
                                12 人，先把 5 人标在中间，再把 12 人标在外面，7 人标在里面。不要把 12 人和
                                5 人标在一起，因为 12 人包含 5 人。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】三集合：为考试中最主流的考法，公式有三种，公式越多越好做
                                题。三集合公式很长，考试一般考查纯代入，考查难度偏低。</p>
                            <p>1.三集合标准型公式：A+B+C-A∩B-A∩C-B∩C+A∩B∩C=总-都不</p>
                            <p>2.推导：三集合分别为 A、B、C，三者之间两两都有交叉关系，考试中从来
                                没考查过四集合和五集合。A+B+C，可以快速覆盖所有点，发现 A∩B 被 A 和 B
                                各计算了一遍，需要去掉重复的一遍，同理 A∩C 和 B∩C 都被计算了两遍，此时
                                都需要减去多余的一遍，为 A+B+C-A∩B-A∩C-B∩C；三集合最大的特殊点就是
                                中间的蓝色网状部分，为 A∩B∩C，A、B、C 的每个部分都含有 A∩B∩C，A∩B、
                                A∩C、B∩C 中都含有 A∩B∩C，加了三遍又减了三遍，此时需要补上一次，称之
                                为补漏，过程为“各加、去重、补漏”，A+B+C-A∩B-A∩C-B∩C+A∩B∩C=总-都
                                不，此时每个点都包含在公式中</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】三集合非标准型：是热门考点，为重中之重。公考第一次考查这
                                个公式时，完全用高中的知识储备来做。非标准是因为推导方式比较特殊。</p>
                            <p>1.公式：A+B+C-满足两项-满足三项*2=总数-都不。</p>
                            <p>2.推导：如下图所示，满足的两项为 x、y、z 区域，x 为 A、B 相交，y 为 B、
                                C 相交，z 为 A、C 相交，其中 m 为 A∩B∩C。A+B+C 中，x 被 A 算了一遍，被 B
                                算了一遍，算了两遍，只重复了一遍。同理，y 被 B、C 各算了一遍，z 被 A、C
                                各算了一遍，均需要减掉一遍。中间 m 被算了三遍，需要减去多余的两遍，
                                A+B+C-x-y-z-2m=全-都不，x+y+z 为满足两项（刚好满足两项）的人数，满足三
                                项的就是中间的 m，替换成文字，A+B+C-满足两项-满足三项*2=总数-都不。
                                </p>
                            <p>3.什么时候用标准型公式，什么时候用非标准型公式，如果把“满足两项的”
                                用一个数字表示，用非标准公式；如果出现“既 A 又 B”、“既 B 又 C”、“既 B 又
                                C”，用标准型公式。</p>
                        </div>
                        <div class="border-radius">
                            <p>【知识点】</p>
                            <p>1.三集合非标准型公式：A+B+C-满足两项-满足三项*2=总数-都不。</p>
                            <p>2.至少有两种电器=有两种电器+有三种电器。</p>
                        </div>
                        <div class="border-radius">
                            <p>【注意】</p>
                            <p>1.常识公式：满足一项+满足两项+满足三项=全-都不。
                            </p>
                            <p>2.理解常识公式中的不重叠：比如参加运动会，不可能存在既参加两个项目，
                                又参加三个项目的情况。</p>
                        </div>
                        <div class="border-radius">
                            <p>【注意】</p>
                            <p>1.至少闯一个红灯的情况，就等于全部情况减去都不闯红灯的情况。</p>
                            <p>2.存在满足三项，但没有满足两项的集合，比如下图所示，集合的形状没有
                                规定一定是圆，集合是没有形状的，可以是任意形状，不需要纠结 x、y 的取值，
                                比如现实中，30 人只投了一个岗位，还有 9 人投了三个岗位，没有人投两个岗
                                位，这种情况是存在的。但本题如果加上条件“有一些人报了两个岗位”，此时
                                x 不能为 0，则答案只能是 A 项</p>
                        </div>
                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>容斥原理</span>
                            </div>
                            <el-tree :data="summary.d8" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>

                    </div>
                </div>
                <div class="section-wrap">
                    <h3 class="text-c section-t" @click="sectionOpenClose('s9')">第九节 排列组合与概率</h3>
                    <div class="section-c" v-show="sectionOpen.s9">
                        <div class="modal-wrap">
                            <h4 class="modal-t">一、排列组合公式</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】分类和分步：</p>
                                    <p>1.分类相加：要么„„要么„„。比如老师从北京去上海，可以坐飞机或者
                                        高铁，飞机有 3 趟，高铁有 5 趟，要么坐飞机，要么坐高铁，是二选一，只需要
                                        选择一类就能完成这件事，所以总共有 3+5=8 种选择。</p>
                                    <p>2.分步相乘：既„„又„„。比如老师从北京去广州，在上海中转，北京到
                                        上海有 8 种选择，上海到广州有 5 种选择，总共有 8*5=40 种选择，先到上海，
                                        再到广州，分步骤，所以用乘法。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【知识点】排列与组合：</p>
                                    <p>1.排列：</p>
                                    <p>（1）与顺序有关，从 n 个元素中有序的选择 m 个元素。</p>
                                    <p>（2）A（n,m）=从 n 开始往下乘 m 个数。</p>
                                    <p>&nbsp;&nbsp;- ①从 10 个同学中选择 3 人有顺序的去做事情，为 A（10,3）=10*9*8。</p>
                                    <p>&nbsp;&nbsp;- ②从 10 个人中有序的选 3 人，第一步是从 10 人中选 1 人，有 10 种选法；
                                        第二步是从 9 人中选 1 人，有 9 种选法；第三步是从 8 人中选 1 人，有 8 种选法，
                                        分步骤进行，用乘法。</p>
                                    <p>2.组合：</p>
                                    <p>（1）与顺序无关。</p>
                                    <p>（2）C（n,m）=分子 A（n,m）/分母 A（m,m）=从 n 开始往下乘 m 个数/从 m
                                        开始往下乘 m 个数，答案是情况数，一定是整数。
                                        </p>
                                    <p>&nbsp;&nbsp;- ①从 10 人中选 3 人去扫地，为 C（10,3）=A（10,3）/A（3,3）=（10*9*8）
                                        /（3*2*1）。
                                        </p>
                                    <p>&nbsp;&nbsp;- ②组合是先在有顺序的基础上，再消除顺序，假设选出甲、乙、丙三人，三
                                        个人内部有顺序，除以三个人的内部顺序，就得到无序的情况。</p>
                                    <p>3.判定标准：从已选的主体中任意挑出两个，调换顺序：
                                    </p>
                                    <p>（1）有差别，与顺序有关（A）。</p>
                                    <p>（2）无差别，与顺序无关（C）。</p>
                                    <p>4.例：</p>
                                    <p>（1）从七个葫芦娃中，任选两个去救爷爷</p>
                                    <p>答：选出大娃、二娃，和选出二娃、大娃，都是去救爷爷，没有区别，与顺
                                        序无关，为 C（7,2）。</p>
                                    <p>（2）从七个葫芦娃中，任选两个去救爷爷（第一个去探路，第二个去打架）。
                                        答：大娃去探路、二娃去打架，和大娃去打架、二娃去探路，调换顺序之后
                                        有区别，为 A（7,2）。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】</p>
                                    <p>1.计算不是排列组合的重点，列式才是重点。</p>
                                    <p>2.在考试中，一般选出人去干一样的事情，是没有顺序的；一般选出人去干
                                        不一样的事情，是有顺序的。</p>
                                    <p>3.排列组合问题用 A 还是 C 需要自己揣摩，可以自己举例子理解，没有死记
                                        硬背的方法</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】在计算 C（n,m），当 m 比较大时，可以转化为：C（n,m）=C（n,n-m），
                                        比如从 10 人中选 9 个人扫地，就等同于选 1 个人不扫地，即 C（10,9）=C（10,1）。</p>
                                </div>
                            </div>
                        </div>
                        <div class="modal-wrap">
                            <h4 class="modal-t">二、经典题型</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】考试中最多的两种题型：</p>
                                    <p>1.捆绑法：相邻。</p>
                                    <p>（1）引例：甲乙丙丁戊己 6 个老师站成一排照相，要求甲乙丙 3 人必须
                                        相邻，有（ ）种不同的站法？</p>
                                    <p>答：要求甲乙丙必须相邻，先把甲乙丙 3 人捆在一起，注意内部有无顺序，
                                        捆起来照相，甲在左、乙在左照相出来是不一样的，所以有顺序，为 A（3,3）
                                        =6；把甲乙丙看成一个“大胖子”和丁、戊、己排序，相当于 4 个元素排序，
                                        为 A（4,4）=24，分步相乘，6*24=144。站成一排照相是有顺序的，站在中间
                                        和站在左边是不一样的，站队、照相都是有顺序的。</p>
                                    <p>（2）方法：
                                    </p>
                                    <p>&nbsp;&nbsp;- ①先捆：把必须相邻的元素捆绑起来，注意内部有无顺序。</p>
                                    <p>&nbsp;&nbsp;- ②再排：将捆绑后的看成一个元素，进行后续排列。</p>
                                    <p>（3）n 人排队=A（n,n），全排列。</p>
                                    <p>2.插空法：不相邻。</p>
                                    <p>（1）引例：甲乙丙丁戊己 6 个老师站成一排照相，要求甲乙丙 3 人必须
                                        不相邻，有（ ）种不同的站法？
                                        </p>
                                    <p>答：（1）先排可以相邻的丁戊己，3 人站成一排，为 A（3,3）=6 种；（2）
                                        3 人排列形成了 4 个空位，再将不相邻的甲、乙、丙插入到 4 个空位中，即从
                                        4 个空位中选 3 个空位插入甲、乙、丙（每个空位只插一个人）。两种思路：
                                        第一种，4 个空中选 3 个空，C（4,3），再把三个人放进去，需要排序，为 A
                                        （3,3），即 C（4,3）*A（3,3）=24；第二种，也可以直接写成“A（4,3）”，
                                        即从 4 个空中选 3 个空马上把甲乙丙三人放进去，谁在左谁在右不一样，有顺
                                        序，为 A（4,3）=24。先排再插，分步相乘，总情况=6*24=144。</p>
                                    <p>（2）方法：
                                    </p>
                                    <p>&nbsp;&nbsp;- ①先排：先安排可以相邻的元素，形成若干个空位。</p>
                                    <p>&nbsp;&nbsp;- ②再插：将不相邻的元素插入到空位中。</p>
                                </div>
                                <div class="border-radius">
                                    <p>2.广东的一道题目：20 个路灯选 10 个路灯停掉，停掉的不能连续，问多少
                                        种情况</p>
                                    <p>答：把 10 个灯放在这里，让它们亮着；10 个灯形成 11 个空，从 11 个空中
                                        选 10 个放入黑灯，C（11,10）=C（11,1）=11 种。</p>
                                </div>
                            </div>
                        </div>
                        <div class="modal-wrap">
                            <h4 class="modal-t">二、经典题型</h4>
                            <div class="modal-c">
                                <div class="border-radius">
                                    <p>【知识点】概率：任何一道排列组合的题目换一种问法就能变成概率题，如
                                        例 4 转化为问“A、B 两位同学不能挨着坐的概率”，先算出总情况为 24，再算满
                                        足要求的情况数为 16，P=16/24。
                                        </p>
                                    <p>1.给情况求概率：概率=满足要求的情况数/总的情况数。</p>
                                    <p>2.给概率求概率：</p>
                                    <p>（1）分类：`P=P_1+P_2+……+P_n`。例：不下雨的概率＝晴天概率+阴天概率，要
                                        么是晴天、要么是阴天，“要么……要么……”是分类，用加法。</p>
                                    <p>（2）分步：`P=P_1*P_2*……*P_n`。例：连续两次闯红灯的概率＝闯第一个的概
                                        率*闯第二个的概率。既闯第一个红灯，又闯第二个红灯，“既„„又„„”用乘
                                        法。
                                        </p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】</p>
                                    <p>1.C（n,n）=1。</p>
                                    <p>2.C（15,13）=C（15,2）=15*14/2=105。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】两个人要凑一起的概率题，先让一个人随便挑，再让第二个人去找
                                        他。</p>
                                </div>
                                <div class="border-radius">
                                    <p>【注意】</p>
                                    <p>1.从 50 题中选 48 题做=从 50 题中选 2 题不做，为 C（50,2）。</p>
                                    <p>2.第二个人与第一个人选择不做的 2 道题目完全相同的情况只有 1 种。假如
                                        第一个人选择 3 题、4 题不做，要完全相同，第二个人也要 3 题、4 题不做。
                                        </p>
                                    <p>3.拓展：知识竞赛共 50 道单项选择题，小李和小王从中各自随机选择 49
                                        道题作答。问他们未选的 1 道题相同的概率是多少？</p>
                                    <p>答：第一个人随便选，`P_(第一步)=100%`；如第一个人第 50 题不做，要求未选的 1
                                        道题相同，则第二个人也要第 50 题不做，所以与第一个人选择不做的题目相同
                                        只有 1 种情况，`P_(第二步)`=与第一个人选择不做的题目相同/50 题中有 1 题不做=1/C
                                        （50,1）=1/50，`P_(第一步)*P_(第二步)=1/50`。</p>
                                </div>
                            </div>
                        </div>

                        <el-card class="summary">
                            <div slot="header" class="clearfix">
                                <span>排列组合与概率</span>
                            </div>
                            <el-tree :data="summary.d9" :props="defaultProps" default-expand-all></el-tree>
                        </el-card>

                    </div>
                </div>



            </div>
        </div>

    </div>
</template>

<script>
    export default {
        data(){
            return {
                mymsg: '这是第二个页面哦~',
                summary: {
                    d1: [],
                    d2: [],
                    d3: [],
                    d4: [],
                    d5: [],
                    d6: [],
                    d7: [],
                    d8: [],
                    d9: [],
                },
                defaultProps: {
                    children: 'children',
                    label: 'label'
                },
                sectionOpen:{},
            };
        },
        created(){
            this.initData();
        },
        mounted(){
            let self = this;
            if(self.commonsVariable.isMathjaxConfig){//判断是否初始配置，若无则配置。
                self.commonsVariable.initMathjaxConfig();
            }
            self.commonsVariable.MathQueue('pdf05');
        },
        methods: {
            sectionOpenClose(sectionNum){
                let self = this;
                self.$set(self.sectionOpen, sectionNum, !self.sectionOpen[sectionNum]);
            },
            // 初始化数据
            initData(){
                let self = this;
                self.getSummary1();
                self.getSummary2();
                self.getSummary3();
                self.getSummary4();
                self.getSummary5();
                self.getSummary6();
                self.getSummary7();
                self.getSummary8();
                self.getSummary9();
            },
            // 总结1内容(代入排除法)
            getSummary1(){
                let self = this;
                let data = [{
                    label: '1.范围：',
                    children: [
                        {label: '（1）典型题：多位数（例 1，个位、十位变化）、年龄（例 2，已知四个人的年龄情况）、不定方程（例 3）、余数（例 3）。'},
                        {label: '（2）看选项：选项为一组数（例 4）。'},
                        {label: '（3）剩两项：只剩两项时，代入一项即得答案，假设选项为 A.3、B.4、C.5、D.6，根据偶数排除 A、C 项，代入一项即得答案，B 项正确则 B 项当选，B 项错误即 D 项当选，即剩二代一。'},
                    ]
                },{
                    label: '2.方法：',
                    children: [
                        {label: '（1）优先排除：尾数（几百+几千的结果不是 3 个 0）、奇偶（偶数*任何数=偶数）、倍数（使用最多、切入点多，从整除、余数、比例都可切入）。'},
                        {label: '（2）直接代入：最值（问最大，从大的开始代，可能有 2 个选项满足题干，需要选其中最大的，若从小往大代入可能会选择了较小的错误选项；问最小从小的代）、好算（整千、整百，有零头的难算）。'},
                    ]
                }];
                self.$set(self.summary, 'd1', data);
            },
            // 总结2内容(倍数特性法)
            getSummary2(){
                let self = this;
                let data = [{
                    label: '.基础知识：',
                    children: [
                        {label: '（1）当 B、C 为整数时，如果 A=B*C，则 A 能被 B、C 整除，用于三量关系、平均数的题目中。'},
                        {label: '（2）口诀：3、9 看各位数字之和，4 看末两位，5 看末位。8*125=1000，几千、几万的数一定可以被 8、125 整除，8、125 的倍数只看末三位。'},
                        {label: '（3）因式分解：12=3*4≠2*6，分解时必须互质。'},
                        {label: '（4）拆分：拆成两个数的和或差。'},
                    ]
                },{
                    label: '余数型：',
                    children: [
                        {label: '（1）若 y=ax+b，则 y-b 能被 a 整除（多退少补，y=a 的倍数多 b，y 退掉 b 后可以被 a 整除）；若 y=ax-b，则 y+b 能被 a 整除。'},
                        {label: '（2）前提：a、x 均为整数。'},
                    ]
                },{
                    label: '3.比例型：条件中存在比例（m/n、m：n、%、倍），问题与比例有关，问分子或分母。',
                    children: [
                        {label: '（1）若 A/B=m/n，则 A 是 m 的倍数，B 是 n 的倍数。A±B 是 m±n 的倍数。'},
                        {label: '（2）前提：A、B 均为整数，m/n 是最简整数比。'},
                    ]
                }];
                self.$set(self.summary, 'd2', data);
            },
            // 总结3内容(方程法)
            getSummary3(){
                let self = this;
                let data = [{
                    label: '普通方程：设 x',
                    children: [
                        {label: '（1）设小不设大（避免分数）。'},
                        {label: '（2）设中间量（方便列式）。'},
                        {label: '（3）求谁设谁（避免陷阱）。'},
                    ]
                },{
                    label: '不定方程：代入排除。',
                    children: [
                        {label: '（1）奇偶特性，系数一奇一偶。'},
                        {label: '（2）倍数特性：系数与常数有公因子。'},
                        {label: '（3）尾数特性：系数尾数为 5 或 0。'},
                        {label: '（4）直接代入选项。'},
                    ]
                },{
                    label: '不定方程组：',
                    children: [
                        {label: '（1）未知数一定是整数，有限解，用消元。'},
                        {label: '（2）未知数不一定是整数，用特值法（一般赋 0）。例 3 中人数是整数，为有限解，不能用赋零法。'},
                    ]
                }];
                self.$set(self.summary, 'd3', data);
            },
            // 总结4内容(工程问题)
            getSummary4(){
                let self = this;
                let data = [{
                    label: '给完工时间型：给多个完成工作的时间。',
                    children: [
                        {label: '（1）先赋总量（公倍数）。'},
                        {label: '（2）再算效率=总量/时间。'},
                        {label: '（3）根据工作过程列方程。'},
                    ]
                },{
                    label: '给效率比例型：可能是直接给效率关系，或者间接给效率关系。',
                    children: [
                        {label: '（1）先赋效率（满足比例即可）。'},
                        {label: '（2）再算总量=效率*时间。'},
                        {label: '（3）根据工作过程列方程。'},
                    ]
                },{
                    label: '给具体单位型：设未知数，找等量关系列方程。',
                },{
                    label: '其他工程：同时开始同时结束，整体分析。不是看细节，而是先分析整体的工作量、效率和，得到整体的时间。',
                }];
                self.$set(self.summary, 'd4', data);
            },
            // 总结5内容(行程问题)
            getSummary5(){
                let self = this;
                let data = [{
                    label: '普通行程',
                    children: [
                        {label: '（1）路程=速度*时间（S=V*t）。'},
                        {label: '（2）火车过桥：路程=车长+桥长。'},
                        {
                            label: '（3）平均速度：',
                            children: [
                                {label: '①总路程/总时间。'},
                                {label: '②等距离平均速度=`(2*V_1*V_2)/(V_1+V_2)`。'},
                            ],
                        },
                    ]
                },{
                    label: '相对行程',
                    children: [
                        {
                            label: '（1）相遇追及：不管是环形还是直线，公式右半部分是没有任何区别，区别在于左边，直线上是两点之间的距离或者追及的距离，环形上就是几圈。',
                            children: [
                                {label: '①相遇（反向）：`S_和=V_和*t`。'},
                                {label: '②追及（同向）：`S_差=V_差*t`。'},
                            ],
                        },
                        {
                            label: '（2）多次运动',
                            children: [
                                {label: '①线形两端出发第 n 次相遇：`（2n-1）*S=V_和*t`；线形同端出发第 n 次相遇：`2n*S=V_和*t`（假设甲、乙从 A 点出发，甲走的快，甲先到达 B 点后返回，然后与乙相遇，此时两人的路程和是 2 个全程，第二次相遇两人的路程和是 4 个全程）。'},
                                {label: '②环形第 n 次相遇：`n 圈=V_和*t`。'},
                                {label: '③环形第 n 次追及：`n 圈=V_差*t`。'},
                            ],
                        },
                        {
                            label: '（3）顺水、逆水：',
                            children: [
                                {label: '①顺水：`S=（V_船+V_水）*t_顺`。'},
                                {label: '②逆水：`S=（V_船-V_水）*t_逆`。'},
                            ],
                        },
                    ]
                }, {
                    label: '比例行程',
                    children: [
                        {label: '（1）S 一定，V、t 成反比。'},
                        {label: '（2）V 一定，S、t 成正比。'},
                        {label: '（3）t 一定，S、V 成正比。'},
                    ]
                }];
                self.$set(self.summary, 'd5', data);
            },
            // 总结6内容(经济利润问题)
            getSummary6(){
                let self = this;
                let data = [{
                    label: '基础经济：',
                    children: [
                        {
                            label: '（1）常见公式：',
                            children: [
                                {label: '①利润=售价-进价。'},
                                {label: '②利润率=利润/进价。'},
                                {label: '③折扣=折后价/折前价。'},
                                {label: '④总价=单价*个数。'},
                            ],
                        },
                        {
                            label: '（2）解题方法：方程法（例 1～例 3）、赋值法（例 4、例 5）',
                        },
                    ]
                }, {
                    label: '分段计费：',
                    children: [
                        {
                            label: '（1）常见题型：水电费（例 6）、出租车费、税费（例 7）。',
                        },
                        {
                            label: '（2）解题方法：分段计费、汇总求和。例 8 是对比求差问题。',
                        },
                    ]
                }];
                self.$set(self.summary, 'd6', data);
            },
            // 总结7内容(最值问题)
            getSummary7(){
                let self = this;
                let data = [{
                    label: '函数最值：往往出现在经济利润问题。',
                    children: [
                        {
                            label: '（1）特征：',
                            children: [
                                {label: '①单价和数量此消彼长。'},
                                {label: '②求最大利润或售价。'},
                            ],
                        },
                        {label: '（2）方法：两点式。令两个括号为 0，求出 `x_1`、`x_2`，`x=(x_1+x_2)/2`。'},
                    ]
                },{
                    label: '构造数列：',
                    children: [
                        {
                            label: '（1）特征：某个主体最多/最少；排名第几……最……。',
                        },
                        {
                            label: '（2）方法：',
                            children: [
                                {label: '①构造一个名次。'},
                                {label: '②求谁设谁。'},
                                {label: '③反向推其他。'},
                                {label: '④加和求解。'},
                            ],
                        },
                        {
                            label: '（3）注意：',
                            children: [
                                {label: '①答案非整数时：问最少向上取整、问最多向下取整。'},
                                {label: '②条件中是否给出主体个数互不相同。如果没有说明互不相同，则可以并列。'},
                            ],
                        },
                    ]
                }, {
                    label: '最不利构造：',
                    children: [
                        {label: '（1）特征：至少……保证……，吉林可能直接问“最多”。'},
                        {label: '（2）方法：最倒霉的情况+1。'},
                    ]
                }];
                self.$set(self.summary, 'd7', data);
            },
            // 总结8内容(容斥原理)
            getSummary8(){
                let self = this;
                let data = [{
                    label: '公式：',
                    children: [
                        {label: '（1）两集合：A+B-A∩B=总数-都不。'},
                        {
                            label: '（2）三集合：',
                            children: [
                                {label: '①标准型：A+B+C-A∩B-A∩C-B∩C+A∩B∩C=总数-都不。'},
                                {label: '②非标准型：A+B+C-满足两项-满足三项*2=总数-都不。'},
                                {label: '③常识型：满足一项+满足两项+满足三项=总数-都不。'},
                            ],
                        },
                    ]
                },{
                    label: '.画图：',
                    children: [
                        {label: '（1）画圈圈，标数据。'},
                        {label: '（2）从里到外，注意去重'},
                    ]
                }];
                self.$set(self.summary, 'd8', data);
            },
            // 总结9内容(排列组合与概率)
            getSummary9(){
                let self = this;
                let data = [{
                    label: '排列组合：',
                    children: [
                        {
                            label: '（1）概念：',
                            children: [
                                {label: '①分类用加法（要么„„要么„„）。'},
                                {label: '②分步用乘法（既„„又„„）。'},
                                {label: '③有序用排列（不可互换）。举例理解用排列还是组合。'},
                                {label: '④无序用组合（可以互换）。'},
                            ],
                        },
                        {
                            label: '（2）题型：放的两个题型是重要题型，还有环形排列、错位排列、重复剔除、插板法等，都考的较少，会添加到学霸养成课中。',
                            children: [
                                {label: '①必须相邻：捆绑法，先捆再排。'},
                                {label: '②不能相邻：插空法，先排再插。'},
                            ],
                        },
                        {
                            label: '（3）正难反易：总情况数-反面情况数。',
                        },
                    ]
                },{
                    label: '2.概率：',
                    children: [
                        {label: '（1）给情况求概率：满足要求的情况数/总情况数。'},
                        {label: '（2）给概率求概率：分类用加法，分步用乘法。'},
                        {label: '（3）正难反易：1-反面情况概率。'},
                    ]
                }];
                self.$set(self.summary, 'd9', data);
            },
            // 总结10内容(特殊增长率)
        },
    };
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="less" scoped>
    .pdf-wrap{
    }
</style>
<style lang="less" rel="stylesheet/less">
    @import "./../../style.less";
</style>